//============================================================================================
/**
 * @file	mmap_get.c
 * @brief	アドレス取得関数
 * @author	Hiroyuki Nakamura
 * @date	2006.02.22
 *
 *	なるべく直接アクセスしたくないけど、SDKに取得関数がないので
 *	仕方ない場合は、ここに取得関数を作って下さい。
 */
//============================================================================================
#include <nitro.h>
#include "mmap_get.h"


//--------------------------------------------------------------------------------------------
/**
 * メイン画面のBGパレットのアドレス取得
 *
 * @param	none
 *
 * @return	メイン画面のBGパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_MainBgPlttAddr(void)
{
	return HW_BG_PLTT;
}

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のBGパレットのサイズ取得
 *
 * @param	none
 *
 * @return	メイン画面のBGパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_MainBgPlttSize(void)
{
	return HW_BG_PLTT_SIZE;
}

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のBGパレットのアドレス取得
 *
 * @param	none
 *
 * @return	サブ画面のBGパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_SubBgPlttAddr(void)
{
	return HW_DB_BG_PLTT;
}

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のBGパレットのサイズ取得
 *
 * @param	none
 *
 * @return	サブ画面のBGパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_SubBgPlttSize(void)
{
	return HW_DB_BG_PLTT_SIZE;
}

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のOBJパレットのアドレス取得
 *
 * @param	none
 *
 * @return	メイン画面のOBJパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_MainObjPlttAddr(void)
{
	return HW_OBJ_PLTT;
}

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のOBJパレットのサイズ取得
 *
 * @param	none
 *
 * @return	メイン画面のOBJパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_MainObjPlttSize(void)
{
	return HW_OBJ_PLTT_SIZE;
}

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のOBJパレットのアドレス取得
 *
 * @param	none
 *
 * @return	サブ画面のOBJパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_SubObjPlttAddr(void)
{
	return HW_DB_OBJ_PLTT;
}

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のOBJパレットのサイズ取得
 *
 * @param	none
 *
 * @return	サブ画面のOBJパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
u32 GF_MMAP_SubObjPlttSize(void)
{
	return HW_DB_OBJ_PLTT_SIZE;
}
