//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		zkn_data_work.c
 *	@brief		図鑑データワーク
 *	@author		tomoya takahashi
 *	@data		2006.07.13
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#include "system.h"
#include "assert.h"
#include <string.h>

#include "include/application/zukanlist/zkn_glbdata.h"

#define __ZKN_DATA_WORK_H_GLOBAL
#include "include/application/zukanlist/zkn_data_work.h"

//-----------------------------------------------------------------------------
/**
 *					コーディング規約
 *		●関数名
 *				１文字目は大文字それ以降は小文字にする
 *		●変数名
 *				・変数共通
 *						constには c_ を付ける
 *						staticには s_ を付ける
 *						ポインタには p_ を付ける
 *						全て合わさると csp_ となる
 *				・グローバル変数
 *						１文字目は大文字
 *				・関数内変数
 *						小文字と”＿”と数字を使用する 関数の引数もこれと同じ
*/
//-----------------------------------------------------------------------------
//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	図鑑保持データワーク
//=====================================
typedef struct _ZKN_DATA_WORK{
	u32 list_monsno;	// リストのモンスターナンバー
	u32 zkn_mode;	// リストのモンスターナンバー
} ;



//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
/**
 *	@brief	ワーク確保
 *
 *	@param	heapID	ヒープ
 */
//-----------------------------------------------------------------------------
ZKN_DATA_WORK* ZKN_DW_Alloc( u32 heapID )
{
	ZKN_DATA_WORK* p_zkn;
	p_zkn = sys_AllocMemory( heapID, sizeof(ZKN_DATA_WORK) );
	memset( p_zkn, 0, sizeof(ZKN_DATA_WORK) );
	p_zkn->zkn_mode = ZKN_MODE_NAZO;
	return p_zkn;
}

//----------------------------------------------------------------------------
/**
 *	@brief	ワーク破棄
 *
 *	@param	p_zkn	図鑑ワーク
 */
//-----------------------------------------------------------------------------
void ZKN_DW_Free( ZKN_DATA_WORK* p_zkn )
{
	sys_FreeMemoryEz( p_zkn );
}

//----------------------------------------------------------------------------
/**
 *	@brief	保持しているリストモンスターナンバー取得
 *
 *	@param	cp_zkn	図鑑ワーク
 *
 *	@return	モンスターナンバー
 */
//-----------------------------------------------------------------------------
u32 ZKN_DW_GetListMonsNo( const ZKN_DATA_WORK* cp_zkn )
{
	return cp_zkn->list_monsno;
}

//----------------------------------------------------------------------------
/**
 *	@brief	保持するモンスターナンバーを取得
 *
 *	@param	p_zkn	図鑑ワーク
 *	@param	monsno	モンスターナンバー
 */
//-----------------------------------------------------------------------------
void ZKN_DW_SetListMonsNo( ZKN_DATA_WORK* p_zkn, u32 monsno )
{
	p_zkn->list_monsno = monsno;
}

//----------------------------------------------------------------------------
/**
 *	@brief	図鑑ﾓｰﾄﾞ
 *
 *	@param	cp_zkn	図鑑ワーク
 */
//-----------------------------------------------------------------------------
u32 ZKN_DW_GetZknMode( const ZKN_DATA_WORK* cp_zkn )
{
	return cp_zkn->zkn_mode;
}

//----------------------------------------------------------------------------
/**
 *	@brief	図鑑ﾓｰﾄﾞ設定
 *	
 *	@param	p_zkn		図鑑ワーク
 *	@param	zkn_mode 
	ZKN_MODE_SHINOH,	// シンオウ図鑑
	ZKN_MODE_ZENKOKU,	// 全国図鑑
	ZKN_MODE_NAZO,		// 不明	（まだ1回も図鑑を開いていないとき）
 */
//-----------------------------------------------------------------------------
void ZKN_DW_SetZknMode( ZKN_DATA_WORK* p_zkn, u32 zkn_mode )
{
	p_zkn->zkn_mode = zkn_mode;
}
