//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		zkn_world_text_data.c
 *	@brief		図鑑世界テキストデータ　とゲーム内国コードをリンクさせるデータ
 *	@author		tomoya takahashi	
 *	@data		2006.03.01
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]

#include "system.h"
#include "assert.h"
#include <string.h>

#include "src/application/zukanlist/zkn_worldtext.h"

#define	__ZKN_WORLD_TEXT_DATA_H_GLOBAL
#include "include/application/zukanlist/zkn_world_text_data.h"

//-----------------------------------------------------------------------------
/**
 *					コーディング規約
 *		●関数名
 *				１文字目は大文字それ以降は小文字にする
 *		●変数名
 *				・変数共通
 *						constには c_ を付ける
 *						staticには s_ を付ける
 *						ポインタには p_ を付ける
 *						全て合わさると csp_ となる
 *				・グローバル変数
 *						１文字目は大文字
 *				・関数内変数
 *						小文字と”＿”と数字を使用する 関数の引数もこれと同じ
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					グローバルデータ
 */
//-----------------------------------------------------------------------------

//-------------------------------------
//	国コードとポケモン外国語テキスト用国コード
//	との対応データ
//=====================================
static const u8 ZKN_WORLD_TEXT_Idx[ ZKN_WORLD_TEXT_NUM ] = {
	LANG_JAPAN,
	LANG_ENGLISH,
	LANG_FRANCE,
	LANG_GERMANY,
	LANG_ITALY,
	LANG_SPAIN
};

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
/**
 *	@brief	国コードから図鑑外国語テキストコードを取得
 *
 *	@param	lang_code	国コード
 *
 *	@retval	外国語テキスト用国コード	
 *	@retval	ZKN_WORLD_TEXT_NUMの時は外国語テキストの無い国コード
 */
//-----------------------------------------------------------------------------
int ZKN_WT_GetLANG_Code_ZKN_WORLD_TEXT_Code( int lang_code )
{
	int i;

	for( i=0; i<ZKN_WORLD_TEXT_NUM; i++ ){

		if( lang_code == ZKN_WORLD_TEXT_Idx[i] ){
			break;
		}
	}
	
	return i;
}

//----------------------------------------------------------------------------
/**
 *	@brief	図鑑外国語テキストコードから国コードを取得
 *
 *	@param	world_text_code	図鑑外国語テキストコード
 *
 *	@retval	国コード	
 */
//-----------------------------------------------------------------------------
int ZKN_WT_GetZKN_WORLD_TEXT_Code_LANG_Code( int world_text_code )
{
	GF_ASSERT( world_text_code < ZKN_WORLD_TEXT_NUM );
	return ZKN_WORLD_TEXT_Idx[ world_text_code ];
}


//----------------------------------------------------------------------------
/**
 *	@brief	モンスターナンバーを外国語テキスト配列インデックスに変更
 *
 *	@param	monsno	モンスターナンバー
 *
 *	@retval	外国語テキスト配列インデックス
 *	@retval	ZKN_WORLD_TEXT_POKE_NUMのときは自国語のデータしかないポケモン
 */
//-----------------------------------------------------------------------------
int ZKN_WT_GetMonsNo_TEXTVERPokeNum( int monsno )
{
	int i;

	for( i=0; i<ZKN_WORLD_TEXT_POKE_NUM; i++ ){

		if( monsno == TEXTVER_PokeNum[i] ){
			break;
		}
	}
	
	return i;
}
