//============================================================================================
/**
 * @file	situation.h
 * @brief	自分状態データアクセス用ヘッダ
 * @author	tamada GAME FREAK inc.
 * @date	2005.12.02
 */
//============================================================================================
#ifndef __SITUATION_H__
#define __SITUATION_H__

#include "system/savedata_def.h"	//SAVEDATA参照のため


//============================================================================================
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	自分状態データ型定義
 */
//----------------------------------------------------------
typedef struct _SITUATION SITUATION;

typedef struct _FIELDOBJ_SAVE FIELDOBJ_SAVE;
//============================================================================================
//============================================================================================
//----------------------------------------------------------
//	セーブデータシステムが依存する関数
//----------------------------------------------------------
extern int Situation_GetWorkSize(void);
extern void Situation_Init(SITUATION * st);

extern int FieldObjSv_GetWorkSize(void);
extern void FieldObjSv_Init(FIELDOBJ_SAVE * sv);

//----------------------------------------------------------
//	セーブデータ取得のための関数
//----------------------------------------------------------
extern SITUATION * SaveData_GetSituation(SAVEDATA * sv);
extern FIELDOBJ_SAVE * SaveData_GetFieldObjSv(SAVEDATA * sv);


//----------------------------------------------------------
//	デバッグ用データ生成のための関数
//----------------------------------------------------------
//extern void Debug_Situation_Make(SITUATION * Situation, const STRCODE * name, int sex);

#endif //__SITUATION_H__
