//============================================================================================
/**
 * @file	tvtopic_battle.h
 * @brief
 * @author	tamada GAME FREAK inc.
 * @date	2006.05.25
 */
//============================================================================================

#ifndef	__TVTOPIC_BATTLE_H__
#define	__TVTOPIC_BATTLE_H__


//--------------------------------------------------------------------
/**
 * @brief	バトルでのテレビトピック用情報ワーク不完全型定義
 */
//--------------------------------------------------------------------
typedef struct TVWATCH_BATTLE_WORK TVWATCH_BATTLE_WORK;

//============================================================================================
//			戦闘処理で呼び出してもらう関数
//============================================================================================
//--------------------------------------------------------------------
/**
 * @brief	テレビトピック生成処理：バトル捕獲
 * @param	tvwcw			テレビトピック用情報保持ワーク
 * @param	pp				対象のポケモン
 * @param	win_lose_flag	戦闘結果
 * @param	ball_count		使用したボールの数
 * @param	heapID			利用可能なヒープ指定
 */
//--------------------------------------------------------------------
extern void TVBATTLE_StoreResult(TVWATCH_BATTLE_WORK * tvwcw, POKEMON_PARAM * pp,
		int win_lose_flag, int ball_count, u32 heapID);


//============================================================================================
//			BATTLE_PARAM生成・削除処理で呼び出す関数
//============================================================================================
//TV捕獲ワーク生成処理
extern TVWATCH_BATTLE_WORK * TVWatchBattleWork_Create(int heapID);

//TV捕獲ワーク削除処理
extern void TVWatchBattleWork_Delete(TVWATCH_BATTLE_WORK * tvwbw);

#endif	//	__TVTOPIC_BATTLE_H__
