//============================================================================================
/**
 * @file	tvtopic_extern.h
 * @brief
 * @author	tamada GAME FREAK inc.
 * @date	2006.05.25
 */
//============================================================================================

#ifndef	__TVTOPIC_EXTERN_H__
#define	__TVTOPIC_EXTERN_H__

#include "savedata/tv_work.h"
#include "poketool/poke_tool.h"

//============================================================================================
//
//	アイテム使用時のテレビトピック生成
//
//============================================================================================
//--------------------------------------------------------------------
/**
 * @brief	トピック生成：良薬は口に苦し！	ポケモンに漢方薬をあげたとき
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	pp			薬をあげたポケモンへのポインタ
 * @param	itemno		薬のアイテムナンバー
 */
//--------------------------------------------------------------------
extern void TVTOPIC_Entry_Watch_UseKanpo(TV_WORK * tvwk, POKEMON_PARAM * pp, u16 itemno);

//--------------------------------------------------------------------
/**
 * @brief	トピック生成：カスタムボール作成！	カスタムカプセルをポケモンにセットしたとき
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	pp			セットしたポケモンへのポインタ
 * @param	seal_no		シールの種類（どれか一つ、適当でよい）
 */
//--------------------------------------------------------------------
extern void TVTOPIC_Entry_Watch_CustomBall(TV_WORK * tvwk, POKEMON_PARAM * pp, u8 seal_no);

//============================================================================================
//
//	
//	テレビトピック生成用状況保持関連
//
//
//============================================================================================
//--------------------------------------------------------------------
/**
 * @brief	コンテスト終了状況の保持
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	pp			参加したポケモンのPOKEMON_PARAMへのポインタ
 * @param	type		コンテストの種類
 * @param	rank		コンテストランク
 * @param	result		コンテスト順位
 *
 * コンテストが終了したときによびだしてください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_ContestTemp_Set(TV_WORK * tvwk, POKEMON_PARAM * pp,
		int type, int rank, int result);

//--------------------------------------------------------------------
/**
 * @brief	連れ歩き公園状況の保持：連れて行くポケモン
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	pp			連れて行くポケモンのPOKEMON_PARAM
 * @param	heapID		利用可能なヒープ指定ID
 *
 * 連れて行くポケモンを決定したときに呼び出してください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_ParkTemp_Init(TV_WORK * tvwk, POKEMON_PARAM * pp, int heapID);

//--------------------------------------------------------------------
/**
 * @brief	連れ歩き公園状況の保持：アクセサリ取得
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	accessories		拾ったアクセサリのID
 *
 *
 * アクセサリを拾ったときに呼び出してください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_ParkTemp_SetAccessories(TV_WORK * tvwk, int accessories);

//--------------------------------------------------------------------
/**
 * @brief	連れ歩き公園状況の保持：アイテム取得
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	item_no		拾ったアイテム
 *
 *
 * アイテムを拾ったときに呼び出してください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_ParkTemp_SetKinomi(TV_WORK * tvwk, int item_no);

//--------------------------------------------------------------------
/**
 * @brief	ポルトミニゲーム状況の保持
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	taste_type	ポルトの種類
 *
 * ポルトを作成したときに呼び出してください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_PorutoTemp_Set(TV_WORK * tvwk, int taste_type);

//--------------------------------------------------------------------
/**
 * @brief	バトルタワー状況の保持
 * @param	tvwk		テレビセーブデータへのポインタ
 * @param	continue_flag		勝ち抜きがつづいているかどうか
 *
 * バトルタワーの受付に戻ったときに呼び出してください
 */
//--------------------------------------------------------------------
extern void TVTOPIC_BTowerTemp_Set(TV_WORK * tvwk, BOOL continue_flag, u16 win_count);

//--------------------------------------------------------------------
//--------------------------------------------------------------------
extern void TVTOPIC_SafariTemp_Init(TV_WORK * tvwk);

//--------------------------------------------------------------------
//--------------------------------------------------------------------
extern void TVTOPIC_SafariTemp_Set(TV_WORK * tvwk, POKEMON_PARAM * pp);





#endif	//	__TVTOPIC_EXTERN_H__
