//=============================================================================================
/**
 * @file	fontdata_loadtype.h
 * @brief	フォントデータの読み出し方式定義
 * @author	taya
 * @date	2006.02.24
 *
 * @li	本当は fontdata_man.h に置いて、それを fontproc.h から include すれば良いが、
 *		そうすると STRCODE 定義なども合わせて読み込まなければならなくなるなどしがらみが多いので
 *		これを作った。これを fontdata_man.h, fontproc.h から include すれば良い。
 */
//=============================================================================================
#ifndef __FONTDATA_LOADTYPE_H__
#define __FONTDATA_LOADTYPE_H__

//--------------------------------------------------------------
/**
 * フォントデータの読み出し方式
 */
//--------------------------------------------------------------
typedef enum {
	FONTDATA_LOADTYPE_ON_MEMORY,	///< 全文字をヒープに常駐させておき、そこから読み出す
	FONTDATA_LOADTYPE_READ_FILE,	///< 必要な文字のみ、逐次ファイルから読み出す
}FONTDATA_LOADTYPE;

#endif
