//============================================================================================
/**
 * @file	mmap_get.h
 * @brief	アドレス取得関数
 * @author	Hiroyuki Nakamura
 * @date	2006.02.22
 *
 *	なるべく直接アクセスしたくないけど、SDKに取得関数がないので
 *	仕方ない場合は、ここに取得関数を作って下さい。
 */
//============================================================================================
#ifndef MMAP_GET_H
#define	MMAP_GET_H
#undef	GLOBAL
#ifdef	MMAP_GET_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif


//--------------------------------------------------------------------------------------------
/**
 * メイン画面のBGパレットのアドレス取得
 *
 * @param	none
 *
 * @return	メイン画面のBGパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_MainBgPlttAddr(void);

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のBGパレットのサイズ取得
 *
 * @param	none
 *
 * @return	メイン画面のBGパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_MainBgPlttSize(void);

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のBGパレットのアドレス取得
 *
 * @param	none
 *
 * @return	サブ画面のBGパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_SubBgPlttAddr(void);

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のBGパレットのサイズ取得
 *
 * @param	none
 *
 * @return	サブ画面のBGパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_SubBgPlttSize(void);

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のOBJパレットのアドレス取得
 *
 * @param	none
 *
 * @return	メイン画面のOBJパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_MainObjPlttAddr(void);

//--------------------------------------------------------------------------------------------
/**
 * メイン画面のOBJパレットのサイズ取得
 *
 * @param	none
 *
 * @return	メイン画面のOBJパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_MainObjPlttSize(void);

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のOBJパレットのアドレス取得
 *
 * @param	none
 *
 * @return	サブ画面のOBJパレットのアドレス
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_SubObjPlttAddr(void);

//--------------------------------------------------------------------------------------------
/**
 * サブ画面のOBJパレットのサイズ取得
 *
 * @param	none
 *
 * @return	サブ画面のOBJパレットのサイズ
 */
//--------------------------------------------------------------------------------------------
GLOBAL u32 GF_MMAP_SubObjPlttSize(void);


#undef GLOBAL
#endif	/* MMAP_GET_H */
