//============================================================================================
/**
 * @file	b_bag_bmp.h
 * @brief	戦闘用バッグ画面 BMP関連
 * @author	Hiroyuki Nakamura
 * @date	05.02.10
 */
//============================================================================================
#ifndef B_BAG_BMP_H
#define B_BAG_BMP_H
#undef GLOBAL
#ifdef B_BAG_BMP_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * BMPウィンドウ初期化
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_BmpInit( BBAG_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとのBMPウィンドウ追加
 *
 * @param	wk		ワーク
 * @param	page	ページ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_BmpAdd( BBAG_WORK * wk, u32 page );

//--------------------------------------------------------------------------------------------
/**
 * 追加BMPウィンドウ削除
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_BmpFree( BBAG_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * BMPウィンドウ全削除
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_BmpFreeAll( BBAG_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * BMP書き込み
 *
 * @param	wk		ワーク
 * @param	page	ページ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_BmpWrite( BBAG_WORK * wk, u32 page );






GLOBAL void BattleBag_Page2_StrItemPut( BBAG_WORK * wk );
GLOBAL void BattleBag_Page2_StrPageNumPut( BBAG_WORK * wk );





//--------------------------------------------------------------------------------------------
/**
 * メッセージ表示
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_TalkMsgSet( BBAG_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * メッセージ表示開始
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattleBag_TalkMsgStart( BBAG_WORK * wk );



GLOBAL void BattleBag_ItemUseMsgSet( BBAG_WORK * wk );




#undef GLOBAL
#endif	// B_BAG_BMP_H
