//============================================================================================
/**
 * @file	b_plist_bmp.h
 * @brief	戦闘用ポケモンリスト画面BMP関連
 * @author	Hiroyuki Nakamura
 * @date	05.02.01
 */
//============================================================================================
#ifndef B_PLIST_BMP_H
#define B_PLIST_BMP_H
#undef GLOBAL
#ifdef B_PLIST_BMP_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * BMPウィンドウ初期化
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_BmpInit( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとのBMPウィンドウ追加
 *
 * @param	wk		ワーク
 * @param	page	ページ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_BmpAdd( BPLIST_WORK * wk, u32 page );

//--------------------------------------------------------------------------------------------
/**
 * 追加BMPウィンドウ削除
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_BmpFree( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * BMPウィンドウ全削除
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_BmpFreeAll( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * BMP書き込み
 *
 * @param	wk		ワーク
 * @param	page	ページ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_BmpWrite( BPLIST_WORK * wk, u32 page );

//--------------------------------------------------------------------------------------------
/**
 * メッセージ表示
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_TalkMsgSet( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * メッセージ表示開始
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_TalkMsgStart( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * HP表示 & HPゲージ表示
 *
 * @param	wk		ワーク
 * @param	pos		ポケモン位置
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_P1_HPPut( BPLIST_WORK * wk, u8 pos );

GLOBAL void BattlePokeList_P1_LvPut( BPLIST_WORK * wk, u8 pos );

GLOBAL void BattlePokeList_PPRcv( BPLIST_WORK * wk, u16 widx, u16 pos );

GLOBAL void BPL_HidenMsgPut( BPLIST_WORK * wk );

GLOBAL void BattlePokeList_ItemUseMsgSet( BPLIST_WORK * wk );

GLOBAL void BattlePokeList_ItemUseSkillErrMsgSet( BPLIST_WORK * wk );


#undef GLOBAL
#endif	// B_PLIST_BMP_H
