//============================================================================================
/**
 * @file	b_plist_obj.h
 * @brief	戦闘用ポケモンリスト画面OBJ処理
 * @author	Hiroyuki Nakamura
 * @date	05.02.07
 */
//============================================================================================
#ifndef B_PLIST_OBJ_H
#define B_PLIST_OBJ_H
#undef GLOBAL
#ifdef B_PLIST_OBJ_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 戦闘用ポケリストOBJ初期化
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_ObjInit( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * 戦闘用ポケリストOBJ削除
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_ObjFree( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ページごとにOBJをセット
 *
 * @param	wk		ワーク
 * @param	page	ページ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokeList_PageObjSet( BPLIST_WORK * wk, u32 page );

//--------------------------------------------------------------------------------------------
/**
 * 技アイコンセット：戦闘 or コンテスト
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BattlePokelist_WazaTypeSet( BPLIST_WORK * wk );

//--------------------------------------------------------------------------------------------
/**
 * ポケモンアイコンアニメ
 *
 * @param	wk		ワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void BPL_PokeIconAnime( BPLIST_WORK * wk );


//GLOBAL void BPL_P2CursorMvTblMake( BPLIST_WORK * wk );

GLOBAL void BattlePokeList_CursorMoveSet( BPLIST_WORK * wk, u8 page );

GLOBAL void BattlePokeList_CursorOff( BPLIST_WORK * wk );



#undef GLOBAL
#endif	// B_PLIST_OBJ_H
