//==============================================================================
/**
 * @file	client_types.h
 * @brief	client_def.hで読み込み、さらに別ファイルでも読み込む必要のある定義など
 * @author	matsuda
 * @date	2006.04.12(水)
 */
//==============================================================================
#ifndef __CLIENT_TYPES_H__
#define __CLIENT_TYPES_H__


//==============================================================================
//	構造体定義
//==============================================================================
///戦闘入力画面カーソル位置記憶
typedef struct{
	s8 command_x;
	s8 command_y;
	
	s8 waza_x;
	s8 waza_y;
	
	s8 poke_x;
	s8 poke_y;
	s8 poke_save_type;
	
	u8 dummy[1];
}CURSOR_SAVE;


#endif	//__CLIENT_TYPES_H__

