//============================================================================================
/**
 * @file	box_mode.h
 * @brief	ボックス画面の呼び出しモード定義（スクリプトから参照できるようにbox.hから独立させた）
 * @author	taya
 * @date	2006.03.22
 */
//============================================================================================
#ifndef __BOX_MODE_H__
#define __BOX_MODE_H__

//------------------------------------------------------
/**
 * ボックス画面動作モード
 */
//------------------------------------------------------
#define BOX_MODE_AZUKERU	(0)		///< あずける
#define BOX_MODE_TURETEIKU	(1)		///< つれていく
#define BOX_MODE_SEIRI		(2)		///< せいり
#define BOX_MODE_ITEM		(3)		///< どうぐせいり
#define BOX_MODE_COMPARE	(4)		///< つよさくらべ

#endif
