//==============================================================================
/**
 * @file	slot.h
 * @brief	ミニゲーム　スロット
 * @author	kagaya
 * @data	05.07.13
 */
//==============================================================================
#ifndef SLOT_H_FILE
#define SLOT_H_FILE

#include "system\procsys.h"
#include "savedata\record.h"
#include "savedata\coin.h"
#include "savedata\config.h"

//==============================================================================
//	define
//==============================================================================
//--------------------------------------------------------------
///	スロット　シンボル
//--------------------------------------------------------------
#define SLOT_COIN_MAX (COIN_MAX)		///<コイン最大枚数

//--------------------------------------------------------------
///	スロット台設定
//--------------------------------------------------------------
typedef enum
{
	SLOT_HARD_0 = 0,	///<難しい
	SLOT_HARD_1,
	SLOT_HARD_2,
	SLOT_HARD_3,
	SLOT_HARD_4,
	SLOT_HARD_5,		///<優しい
	SLOT_HARD_MAX,		///<設定最大
}SLOT_HARD;

//==============================================================================
//	struct
//==============================================================================
//--------------------------------------------------------------
///	SLOT_PARAM構造体
//--------------------------------------------------------------
typedef struct
{
	int *coin;				///<コイン枚数
	SLOT_HARD hard;			///<SLOT_HARD
	RECORD *record;			///<RECORD *
	int r_count;			///<連勝数
	WINTYPE win_type;		///<ウィンドウタイプ
}SLOT_PARAM;

#define SLOT_PARAM_SIZE (sizeof(SLOT_PARAM))

//==============================================================================
//	外部参照
//==============================================================================
extern PROC_RESULT SlotProc_Init( PROC *proc, int *seq );
extern PROC_RESULT SlotProc_Main( PROC *proc, int *seq );
extern PROC_RESULT SlotProc_End( PROC *proc, int *seq );

#endif //SLOT_H_FILE
