//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		poke_number.h
 *	@brief		シンオウ　全国　ポケモンナンバー　取得	
 *	@author		tomoya takahashi
 *	@data		2006.03.24
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __POKE_NUMBER_H__
#define __POKE_NUMBER_H__


#include "savedata/savedata_def.h"	//SAVEDATA参照のため
#include "savedata/zukanwork.h"

#undef GLOBAL
#ifdef	__POKE_NUMBER_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	ポケモンナンバーモード
//=====================================
enum{
	PM_NUMBER_SHINOU,		// シンオウ地方のポケモンナンバー
	PM_NUMBER_ZENKOKU,		// 全国でのポケモンナンバー
	PM_NUMBER_MODE_NUM		// モード数
};

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	セーブデータから現在の
//	表示ポケモンナンバーモード取得
//=====================================
GLOBAL u32 PMNumber_GetMode( SAVEDATA* p_savedata );
GLOBAL u32 PMNumber_GetMode_ZW( const ZUKAN_WORK* cp_zukan );
//-------------------------------------
//	モードのポケモンナンバー取得
//=====================================
GLOBAL u32 PMNumber_GetPokeNumber( u32 mode, u32 monsno );

#undef	GLOBAL
#endif		// __POKE_NUMBER_H__

