//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		imc_acce_score.h
 *	@brief		アクセサリ得点計算システム
 *	@author		tomoya takahshi
 *	@data		2006.04.06
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __IMC_ACCE_SCORE_H__
#define __IMC_ACCE_SCORE_H__

#include "include/savedata/imageclip_data.h"

#undef GLOBAL
#ifdef	__IMC_ACCE_SCORE_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
//----------------------------------------------------------------------------
/**
 * [１	まずこれでテーマの得点データを取得]
 *	@brief	テーマの得点データを取得
 *
 *	@param	heap	ヒープ
 *	@param	theme	テーマ
 *
 *	@return	テーマ得点データ		＊メモリ破棄の必要があります
 */
//-----------------------------------------------------------------------------
GLOBAL u8* IMC_ACCE_ScoreDataGet( u32 heap, u32 theme );
//----------------------------------------------------------------------------
/**
 * [２	テーマの得点データとセーブデータから得点を計算する]
 *	@brief	アクセサリ得点計算
 *
 *	@param	cp_data			セーブデータ
 *	@param	cp_thema_score	テーマ得点データ
 *
 *	@return	得点
 */
//-----------------------------------------------------------------------------
GLOBAL u32	IMC_ACCE_ScoreGet( const IMC_CONTEST_SAVEDATA* cp_data, const u8* cp_theme_score );


#undef	GLOBAL
#endif		// __IMC_ACCE_SCORE_H__

