//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		imc_rbox_player.h
 *	@brief		右ボックスプレイヤー
 *	@author		tomoya takahashi
 *	@data		2005.10.26
 *
 * ●右ボックスの初期化を行い、プレイヤー関数に設定することで
 * 　アニメーションするようになります。
 * 
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __IMC_RBOX_PLAYER_H__
#define __IMC_RBOX_PLAYER_H__

#include "include/application/imageClip/imc_right_box.h"
#include "include/application/imageClip/imc_bg.h"

#undef GLOBAL
#ifdef	__IMC_RBOX_PLAYER_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	
//	右ボックスプレイヤー
//	
//=====================================
typedef struct {
	const IMC_RIGHT_BOX* rbox;
	
	IMC_BG_ANM	bg_anm;
} IMC_RBOX_PLAYER;


//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
//----------------------------------------------------------------------------
/**
 *
 *	@brief	右ボックスプレイヤー初期化
 *
 *	@param	rbox_player	右ボックスプレイヤー
 *	@param	rbox		右ボックス構造体
 *	@param	heap		使用するヒープ
 *
 *	@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void IMC_RBOX_PLAYER_Init( IMC_RBOX_PLAYER* rbox_player, const IMC_RIGHT_BOX* rbox, int heap );

//----------------------------------------------------------------------------
/**
 *
 *	@brief	右ボックスプレイヤーメイン
 *	
 *	@param	rbox_player		右ボックスプレイヤー
 *
 *	@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void IMC_RBOX_PLAYER_Main( IMC_RBOX_PLAYER* rbox_player );

//----------------------------------------------------------------------------
/**
 *
 *	@brief	右ボックスプレイヤー破棄
 *
 *	@param	rbox_player		右ボックスプレイヤー
 *
 *	@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void IMC_RBOX_PLAYER_Delete( IMC_RBOX_PLAYER* rbox_player );

#undef	GLOBAL
#endif		// __IMC_RBOX_PLAYER_H__

