//==============================================================================
/**
 * @file	poke_anm_b003_1.s
 * @brief	縦にブルブル
 * @author	saito
 * @date	
 *
 */
//==============================================================================

	.text
	
	.include	"past.h"
	.include	"past_def.h"
	
	.global		PAST_ANIME_B003_1
	
// =============================================================================
//
//
//	背面	縦にブルブルクイック
//
//
// =============================================================================
PAST_ANIME_B003_1:
	//16回の処理で9周を処理
	CALL_MF_CURVE_DIVTIME	APPLY_SET,0,CURVE_SIN_MINUS,TARGET_DY,6,0x10000*9,0,16
	HOLD_CMD

	END_ANM
