//==============================================================================
/**
 * @file	poke_anm019.s
 * @brief	横に引っ張る
 * @author	
 * @date	
 *
 */
//==============================================================================

	.text
	
	.include	"past.h"
	.include	"past_def.h"
	
	.global		PAST_ANIME019
	
// =============================================================================
//
//
//	横に引っ張る
//
//
// =============================================================================
PAST_ANIME019:
	//20回のループで180°（0x8000）処理
	CALL_MF_CURVE_DIVTIME APPLY_SET,0,CURVE_SIN,TARGET_RX,0x28,0x8000,0,20
	//ウェイト5　10回のループで4周0x40000）分処理
	CALL_MF_CURVE_DIVTIME APPLY_SYNTHE,5,CURVE_SIN,TARGET_RX,0x10,0x40000,0,10
	HOLD_CMD
	
	END_ANM
