//==============================================================================
/**
 * @file	poke_anm017.s
 * @brief	ポケモンアニメ 横揺れ　スロー
 * @author	saito
 * @date	
 *
 */
//==============================================================================

	.text
	
	.include	"past.h"
	.include	"past_def.h"
	
	.global		PAST_ANIME017
	
// =============================================================================
//
//
//	横揺れ　スロー
//
//
// =============================================================================
PAST_ANIME017:
	//40回のループで1.5周（0x18000）分を処理
	CALL_MF_CURVE_DIVTIME	APPLY_SET,0,CURVE_SIN_MINUS,TARGET_DX,6,0x18000,0,40
	HOLD_CMD
	END_ANM
