//============================================================================================
/**
 * @file	seedbed_local.h
 * @author	tamada
 * @date	2005.02.01
 * @brief	きのみ状態データ、ローカルヘッダ
 */
//============================================================================================
#ifndef	__SEEDBED_LOCAL_H__
#define	__SEEDBED_LOCAL_H__

#include "savedata/savedata_def.h"

#include "savedata/seedbed.h"

//============================================================================================
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	木の実を植えられる場所の数
 */
//----------------------------------------------------------
#define	SEEDBED_MAX	(128)

//----------------------------------------------------------
/**
 * @brief	きのみ状態データの不完全型定義
 */
//----------------------------------------------------------
struct _SEEDBED {
	u8 type;			///<きのみの種類
	u8 stat;			///<きのみの状態（SEEDSTATの定義を参照）
	u16 grow_time;		///<次の成長までのカウント（分単位）
	u16 dry_time;		///<土が乾くまでのカウント（分単位）
	u8 seed_count;		///<実がなった回数
	u16 nuts_count;		///<実のできた個数
	u8 ground_hp;		///<土のHP（０～１００）
	u8 seed_hp;			///<きのみのHP（０～１０）

	u8 compost;			///<肥料の種類
	u8 growth_flag;		///<成長するかどうかのフラグ
};


#endif	/* __SEEDBED_LOCAL_H__ */
