//============================================================================================
/**
 * @file	wifihistory_local.h
 * @brief	WiFi通信履歴データ構造定義ヘッダ
 * @date	2006.03.25
 */
//============================================================================================

#ifndef	__WIFIHISTORY_LOCAL_H__
#define	__WIFIHISTORY_LOCAL_H__

#include "savedata/wifihistory.h"

//============================================================================================
//============================================================================================

enum {
	///国ごとに確保するデータサイズ（バイト単位）
	NATION_DATA_SIZE = WIFI_AREA_MAX * 2 / 8,
	//↑１データあたり2ビット必要でバイト単位に直すために8で割っている
};
//----------------------------------------------------------
/**
 * @brief	WiFi通信履歴データ用構造体定義
 */
//----------------------------------------------------------
struct _WIFI_HISTORY{
	///日付
	u32	date;
	u8 world_flag;			///<全世界対象モードかどうかのフラグ
	u8 my_nation;			///<自分の国
	u8 my_area;				///<自分の地域
	///履歴データ
	u8	data[(WIFI_NATION_MAX - 1) * NATION_DATA_SIZE];

};

#endif	/* __WIFIHISTORY_LOCAL_H__ */
