//============================================================================================
/**
 * @file	btl_searcher.h
 * @bfief	バトルサーチャー
 * @author	Satoshi Nohara
 * @date	06.04.26
 */
//============================================================================================
#ifndef BTL_SEARCHER_H
#define BTL_SEARCHER_H


//============================================================================================
//	定義
//============================================================================================
#define	BS_BATTERY_MAX		(100)			//バッテリーカウンターの最大値
#define	BS_CLEAR_MAX		(100)			//クリアカウンターの最大値


//============================================================================================
//	extern宣言
//============================================================================================

//----------------------------------------------------------------------------------------------
/**
 * イベント呼び出し
 * 
 * @param	event		イベント制御ワークへのポインタ
 *
 * @retval	none
 */
//----------------------------------------------------------------------------------------------
extern void EventCmd_BtlSearcher(GMEVENT_CONTROL* event,WORDSET* wordset,u16* ret_wk);

//----------------------------------------------------------------------------------------------
/**
 * 歩数カウント
 *
 * @param   fsys	FIELDSYS_WORK型のポインタ
 *
 * @retval	"FALSE	何もしない"
 */
//----------------------------------------------------------------------------------------------
extern BOOL BS_StepCountUp( FIELDSYS_WORK* fsys );

//----------------------------------------------------------------------------------------------
/**
 * FIELD_OBJ_PTRの再戦トレーナーIDを取得
 *
 * @param   fsys		FIELDSYS_WORK型のポインタ
 * @param   fldobj		FIELD_OBJ_PTR
 * @param   tr_id		検索するトレーナーID
 *
 * @retval  "0 = データなし、0以外 = トレーナーID"
 *
 * @li		"トレーナーID = 0 = 自分"として扱われている(再戦データテーブルに含まれていないのでOK)
 */
//----------------------------------------------------------------------------------------------
extern u16 BS_TrainerIDCheck( FIELDSYS_WORK* fsys, FIELD_OBJ_PTR fldobj, u16 tr_id );

//----------------------------------------------------------------------------------------------
/**
 * 再戦動作コードだったら、現在向いている方向固定の動作コードをセットする(戦闘後に呼ばれる)
 *
 * @param   fsys		FIELDSYS_WORK型のポインタ
 * @param   fldobj		FIELD_OBJ_PTR
 *
 * @retval  none
 */
//----------------------------------------------------------------------------------------------
extern void BS_MvReWarClearDirMvSet( FIELDSYS_WORK* fsys, FIELD_OBJ_PTR fldobj );


#endif	/* BTL_SEARCHER_H */


