//============================================================================================
/**
 * @file	check_data.h
 * @brief	イベント起動チェック用データ定義ヘッダ
 * @date	2005.10.14
 *
 * src/fielddata/eventdata/のイベントデータコンバータからも参照されている。
 * そのためこの中に記述できる内容にはかなり制限があることを注意すること。
 */
//============================================================================================
#ifndef	__CHECK_DATA_H__
#define	__CHECK_DATA_H__

//------------------------------------------------------------------
///特殊接続指定用ID
//------------------------------------------------------------------
#define	ZONE_ID_SPECIAL		(0x0fff)
#define	SPECIAL_SPEXIT01	(0x0100)

//------------------------------------------------------------------
//------------------------------------------------------------------
typedef struct _EVENTDATA_HEADER EVENTDATA_HEADER;

struct _EVENTDATA_HEADER {
	u32 bg_count;
	u32 obj_count;
	u32 connect_count;
	u32 pos_count;
};
//------------------------------------------------------------------
///ドアリンク用データ構造体
//------------------------------------------------------------------
typedef struct _CONNECT_DATA CONNECT_DATA;

struct _CONNECT_DATA{
	u16	x;
	u16	z;
	u16	link_zone_id;
	u16	link_door_id;
	int	height;
};

//------------------------------------------------------------------
///BG話かけデータ構造体
//------------------------------------------------------------------
typedef struct _BG_TALK_DATA BG_TALK_DATA;

struct _BG_TALK_DATA{
	u16	id;			// ID
	u16	type;		// データタイプ
	int	gx;			// X座標
	int	gz;			// Y座標
	int	height;		// 高さ
	u16	dir;		// 話しかけ方向タイプ
};

//------------------------------------------------------------------
///POS発動イベントデータ構造体
//------------------------------------------------------------------
typedef struct _POS_EVENT_DATA POS_EVENT_DATA;

struct _POS_EVENT_DATA{
	u16	id;			//ID
	u16	gx;			//x
	u16	gz;			//z
	u16	sx;			//sizeX
	u16	sz;			//sizeZ
	u16	height;		//height
	u16 param;
	u16 workID;
};



#endif	/*	__CHECK_DATA_H__ */
