#ifdef	PM_DEBUG
//#define	USE_DEBUG_SCRIPT_PRINT

#ifdef	USE_DEBUG_SCRIPT_PRINT

//-----------------------------------------------------------------------------
/**
 *	デバッグ専用命令　ワークの中身
 */
//-----------------------------------------------------------------------------
BOOL DebugScriptPrintWork(VM_MACHINE * core);

//-----------------------------------------------------------------------------
/**
 *	デバッグ専用命令　フラグの値を表示
 */
//-----------------------------------------------------------------------------
BOOL DebugScriptPrintFlag(VM_MACHINE * core);

#endif

#endif
