//============================================================================================
/**
 * @file	d_zonename.c
 * @brief	デバッグ用ゾーン名取得
 * @author	tamada
 * @date	2006.03.09
 *
 * 非常駐領域に配置されているのでいつでも取得できるわけではないことに注意
 */
//============================================================================================

#ifdef	PM_DEBUG

#include "common.h"

#include "zonedata.h"


//------------------------------------------------------------------
//------------------------------------------------------------------

//============================================================================================
//============================================================================================
static char zonename[16];
//------------------------------------------------------------------
/**
 * @brief	地名メッセージ指定IDの取得
 * @param	zone_id		ゾーン指定
 * @return	u32			地名メッセージ指定ＩＤ
 */
//------------------------------------------------------------------
const char * ZoneData_GetZoneName(int zone_id)
{
	
	zone_id = ZoneData_CheckRange(zone_id);
	{
		FSFile pfile;

		FS_InitFile(&pfile);
		FS_OpenFile(&pfile, "fielddata/maptable/mapname.bin");
		FS_SeekFile(&pfile, zone_id * 16, FS_SEEK_SET);
		FS_ReadFile(&pfile, zonename, 16);
		FS_CloseFile(&pfile);
		return zonename;
	}
}

#endif	//PM_DEBUG

