//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *@file		effect_uground.h
 *@brief	地下マップ移動エフェクト
 *@author	tomoya takahashi
 *@data		2005.08.03
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __EFFECT_UGROUND_H__
#define __EFFECT_UGROUND_H__

#include "fieldsys.h"

#undef GLOBAL
#ifdef	__EFFECT_UGROUND_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	
//	エフェクトナンバー
//	
//=====================================
enum{
	EFCT_UG_DOWN00,		// 地下に降りる
	EFCT_UG_DOWN01,		// 地下に降りる
	EFCT_UG_UP00,		// 地下からあがる
	EFCT_UG_UP01,		// 地下からあがる
};

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
/**
 *
 *@brief	地下マップフェードエフェクト
 *
 *@param	fsys	フィールドシステムワーク
 *@param	no		エフェクトナンバー
 *@param	end		終了チェックフラグ
 *
 *@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void StartUnderGroundEffect(FIELDSYS_WORK* fsys, int no, BOOL* end);

//----------------------------------------------------------------------------
/**
 *
 *@brief	地下レーダー初期化
 *
 *@param	none	
 *
 *@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void InitUnderGroundRadar(GF_BGL_INI* bgl);
//----------------------------------------------------------------------------
/**
 *
 *@brief	地下レーダー破棄
 *
 *@param	none
 *
 *@return	none
 *
 *
 */
//-----------------------------------------------------------------------------
GLOBAL void DeleteUnderGroundRadar(GF_BGL_INI* bgl);

#undef	GLOBAL
#endif		// __EFFECT_UGROUND_H__

