//============================================================================================
/**
 * @file	ev_poketch.h
 * @brief	ポケッチ関連フィールドイベント
 * @date	2005.10.28
 * @author	taya
 */
//============================================================================================
#ifndef	__EVENT_POKETCH_H__
#define	__EVENT_POKETCH_H__

#include "field_event.h"

//-----------------------------------------------------------------------------
/**
 * @brief	イベントサブコマンド：ポケッチ取得
 * @param	event		親イベントワークへのポインタ
 *
 * 下画面フェードアウト→ポケッチ取得フラグ切り替え→下画面再構築、フェードインまで
 */
//-----------------------------------------------------------------------------
extern void EventCmd_GetPoketch(GMEVENT_CONTROL * event);





#endif	/* __EVENT_MAPCHANGE_H__ */
