//============================================================================================
/**
 * @file	fd_shop.h
 * @brief	フレンドリィショップ処理
 * @author	Hiroyuki Nakamura
 * @date	2004.12.15
 */
//============================================================================================
#ifndef FD_SHOP_H
#define FD_SHOP_H
#undef GLOBAL
#ifdef FD_SHOP_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	定数定義
//============================================================================================
#define	SHOP_TYPE_ITEM	( 0 )		// アイテムショップ
#define	SHOP_TYPE_GOODS	( 1 )		// グッズショップ
#define	SHOP_TYPE_SEAL	( 2 )		// シールショップ


//============================================================================================
//	プロトタイプ宣言
//============================================================================================
GLOBAL void ShopInit(
				GMEVENT_CONTROL * event, FIELDSYS_WORK * repw, u16 * item, u8 type, BOOL dp_flg );


#undef GLOBAL
#endif	/* FD_SHOP_H */
