//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		field_trade_cmd.h
 *	@brief		ゲーム内交換　常駐　イベントコマンド
 *	@author		tomoya takahashi
 *	@data		2006.05.16
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __FIELD_TRADE_CMD_H__
#define __FIELD_TRADE_CMD_H__

#include "field_common.h"
#include "field_trade.h"

#undef GLOBAL
#ifdef	__FIELD_TRADE_CMD_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
// 交換実行
GLOBAL void EventCmd_FldTrade(GMEVENT_CONTROL * event, FLD_TRADE_WORK* p_work, int party_pos, u32 heapID );

#undef	GLOBAL
#endif		// __FIELD_TRADE_CMD_H__

