//==============================================================================
/**
 * @file	field_flysky.h
 * @brief	フィールド　カットイン
 * @author	kagaya
 * @data	05.07.13
 */
//==============================================================================
#ifndef FIELD_FLYSKY_H_FILE
#define FIELD_FLYSKY_H_FILE

#include "fieldsys.h"
#include "poketool/poke_tool.h"

//==============================================================================
//	define
//==============================================================================

//==============================================================================
//	typedef
//==============================================================================

//==============================================================================
//	外部参照
//==============================================================================
extern void * EventWorkSet_FlySkyMapChange( u32 heap_id,
		FIELDSYS_WORK *fsys, POKEMON_PARAM *param, u16 zone_id, s16 map_gx, s16 map_gz );

extern BOOL GMEVENT_FlySkyMapChange( GMEVENT_CONTROL *event );

#endif //FIELD_FLYSKY_H_FILE
