//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		fld_enceff_data.h
 *	@brief		フィールドエンカウントデータ
 *	@author		tomoya takahashi
 *	@data		2006.06.08
 *
 *	バトルパラメータから
 *	エンカウントエフェクト　BGMをけっていするルーチン
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __FIELD_ENCOUNT_DATA_H__
#define __FIELD_ENCOUNT_DATA_H__

#include "battle/battle_common.h"

#undef GLOBAL
#ifdef	__FIELD_ENCEFF_DATA_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------

//----------------------------------------------------------------------------
/**
 *	[特殊エンカウントタイプ定数 の取得は内部で行う]
 *	@brief	エンカウントエフェクトナンバーの取得
 *	@param	p_bp	バトルパラメータ
 *	@return	エンカウントエフェクトナンバー
 */
//-----------------------------------------------------------------------------
GLOBAL u32 FLD_EncEffSpDataEffectNoPackGet( const BATTLE_PARAM* p_bp );
//----------------------------------------------------------------------------
/**
 *	[特殊エンカウントタイプ定数 の取得は内部で行う]
 *	@brief	BGMナンバーの取得
 *	@param	p_bp	バトルパラメータ
 *	@return	BGMナンバー
 */
//-----------------------------------------------------------------------------
GLOBAL u32 FLD_EncEffSpDataBgmNoPackGet( const BATTLE_PARAM* p_bp );


#undef	GLOBAL
#endif		// __FIELD_ENCOUNT_DATA_H__

