//==============================================================================
/**
 * @file	fldeff_ok.h
 * @brief	一枚ポリゴン 地下用 OKマーク
 * @author	k.ohno
 * @data	06.02.13
 */
//==============================================================================
#ifndef FLDEFF_OK_H_FILE
#define FLDEFF_OK_H_FILE

#include "fieldobj.h"
#include "field_effect.h"

//==============================================================================
//	typedef
//==============================================================================

//==============================================================================
//	外部参照
//==============================================================================
extern void * FE_Ok_Init( FE_SYS *fes );
extern void FE_Ok_Delete( void *work );

extern EOA_PTR FE_Ok_Add( FIELD_OBJ_PTR fldobj );

#endif //FLDEFF_OK_H_FILE

