//==============================================================================
/**
 * @file	fldeff_flag.h
 * @brief	àÍñáÉ|ÉäÉSÉì ä¯
 * @author	k.ohno
 * @data	06.01.29
 */
//==============================================================================
#ifndef FLDEFF_FLAG_H_FILE
#define FLDEFF_FLAG_H_FILE

#include "fieldobj.h"
#include "field_effect.h"

//==============================================================================
//	typedef
//==============================================================================

//==============================================================================
//	äOïîéQè∆
//==============================================================================
extern void * FE_Flag_Init( FE_SYS *fes );
extern void FE_Flag_Delete( void *work );

extern EOA_PTR FE_Flag_Add( FIELD_OBJ_PTR fldobj );

#endif //FLDEFF_FLAG_H_FILE

