//==============================================================================
/**
 * @file	fldeff_trapsmog.h
 * @brief	ínâ∫  ÇÌÇ»Ç…Ç©Ç©Ç¡ÇΩéûÇÃâå
 * @author	k.ohno
 * @data	06.05.05
 */
//==============================================================================
#ifndef FLDEFF_TRAPSMOG_H_FILE
#define FLDEFF_TRAPSMOG_H_FILE

#include "fieldobj.h"
#include "field_effect.h"

//==============================================================================
//	define
//==============================================================================

//==============================================================================
//	typedef
//==============================================================================

//==============================================================================
//	äOïîéQè∆
//==============================================================================
extern void * FE_Trapsmog_Init( FE_SYS *fes );
extern void FE_Trapsmog_Delete( void *work );

extern void FE_FldOBJTrapsmogSet(  FIELDSYS_WORK *fsys, int gx, int gy, int gz );

#endif //FLDEFF_TRAPSMOG_H_FILE
