
const u16 KowazaTable[] = {
		MONSNO_HUSIGIDANE+20000,
		113,		//ひかりのかべ
		130,		//ロケットずつき
		219,		//しんぴのまもり
		204,		//あまえる
		80,		//はなびらのまい
		345,		//マジカルリーフ
		320,		//くさぶえ
		174,		//のろい
		275,		//ねをはる
		267,		//しぜんのちから
		133,		//ドわすれ
		437,		//リーフストーム
		MONSNO_HITOKAGE+20000,
		187,		//はらだいこ
		246,		//げんしのちから
		157,		//いわなだれ
		44,		//かみつく
		200,		//げきりん
		251,		//ふくろだたき
		14,		//つるぎのまい
		349,		//りゅうのまい
		242,		//かみくだく
		407,		//ドラゴンダイブ
		232,		//メタルクロー
		394,		//フレアドライブ
		MONSNO_ZENIGAME+20000,
		243,		//ミラーコート
		114,		//くろいきり
		54,		//しろいきり
		193,		//みやぶる
		175,		//じたばた
		287,		//リフレッシュ
		300,		//どろあそび
		281,		//あくび
		330,		//だくりゅう
		252,		//ねこだまし
		392,		//アクアリング
		453,		//アクアジェット
		MONSNO_POPPO+20000,
		228,		//おいうち
		185,		//だましうち
		193,		//みやぶる
		211,		//はがねのつばさ
		314,		//エアカッター
		403,		//エアスラッシュ
		413,		//ブレイブバード
		253,		//さわぐ
		MONSNO_KORATTA+20000,
		103,		//いやなおと
		172,		//かえんぐるま
		154,		//みだれひっかき
		44,		//かみつく
		68,		//カウンター
		179,		//きしかいせい
		253,		//さわぐ
		207,		//いばる
		387,		//とっておき
		382,		//さきどり
		MONSNO_ONISUZUME+20000,
		185,		//だましうち
		206,		//みねうち
		184,		//こわいかお
		98,		//でんこうせっか
		161,		//トライアタック
		310,		//おどろかす
		143,		//ゴッドバード
		18,		//ふきとばし
		253,		//さわぐ
		MONSNO_AABO+20000,
		228,		//おいうち
		21,		//たたきつける
		180,		//うらみ
		251,		//ふくろだたき
		305,		//どくどくのキバ
		184,		//こわいかお
		342,		//ポイズンテール
		50,		//かなしばり
		MONSNO_SANDO+20000,
		175,		//じたばた
		219,		//しんぴのまもり
		68,		//カウンター
		229,		//こうそくスピン
		157,		//いわなだれ
		232,		//メタルクロー
		14,		//つるぎのまい
		306,		//ブレイククロー
		400,		//つじぎり
		MONSNO_NIDORAN_F+20000,
		48,		//ちょうおんぱ
		50,		//かなしばり
		36,		//とっしん
		116,		//きあいだめ
		204,		//あまえる
		68,		//カウンター
		251,		//ふくろだたき
		228,		//おいうち
		MONSNO_NIDORAN_M+20000,
		68,		//カウンター
		50,		//かなしばり
		48,		//ちょうおんぱ
		36,		//とっしん
		133,		//ドわすれ
		93,		//ねんりき
		251,		//ふくろだたき
		389,		//ふいうち
		MONSNO_ROKON+20000,
		185,		//だましうち
		95,		//さいみんじゅつ
		175,		//じたばた
		180,		//うらみ
		50,		//かなしばり
		336,		//とおぼえ
		244,		//じこあんじ
		257,		//ねっぷう
		394,		//フレアドライブ
		326,		//じんつうりき
		412,		//エナジーボール
		MONSNO_ZUBATTO+20000,
		98,		//でんこうせっか
		228,		//おいうち
		185,		//だましうち
		16,		//かぜおこし
		18,		//ふきとばし
		174,		//のろい
		417,		//わるだくみ
		95,		//さいみんじゅつ
		428,		//しねんのずつき
		413,		//ブレイブバード
		MONSNO_NAZONOKUSA+20000,
		14,		//つるぎのまい
		75,		//はっぱカッター
		175,		//じたばた
		235,		//こうごうせい
		204,		//あまえる
		275,		//ねをはる
		321,		//くすぐる
		MONSNO_PARASU+20000,
		206,		//みねうち
		103,		//いやなおと
		68,		//カウンター
		60,		//サイケこうせん
		175,		//じたばた
		230,		//あまいかおり
		113,		//ひかりのかべ
		228,		//おいうち
		232,		//メタルクロー
		450,		//むしくい
		440,		//クロスポイズン
		MONSNO_KONPAN+20000,
		226,		//バトンタッチ
		103,		//いやなおと
		202,		//ギガドレイン
		324,		//シグナルビーム
		97,		//こうそくいどう
		234,		//あさのひざし
		390,		//どくびし
		450,		//むしくい
		MONSNO_DHIGUDA+20000,
		185,		//だましうち
		103,		//いやなおと
		246,		//げんしのちから
		228,		//おいうち
		251,		//ふくろだたき
		253,		//さわぐ
		157,		//いわなだれ
		426,		//どろばくだん
		310,		//おどろかす
		MONSNO_NYAASU+20000,
		180,		//うらみ
		204,		//あまえる
		95,		//さいみんじゅつ
		133,		//ドわすれ
		244,		//じこあんじ
		274,		//ねこのて
		316,		//かぎわける
		175,		//じたばた
		387,		//とっておき
		386,		//おしおき
		MONSNO_KODAKKU+20000,
		95,		//さいみんじゅつ
		60,		//サイケこうせん
		193,		//みやぶる
		113,		//ひかりのかべ
		248,		//みらいよち
		94,		//サイコキネシス
		238,		//クロスチョップ
		287,		//リフレッシュ
		109,		//あやしいひかり
		281,		//あくび
		426,		//どろばくだん
		MONSNO_MANKII+20000,
		157,		//いわなだれ
		193,		//みやぶる
		96,		//ヨガのポーズ
		68,		//カウンター
		179,		//きしかいせい
		251,		//ふくろだたき
		279,		//リベンジ
		265,		//きつけ
		370,		//インファイト
		MONSNO_GAADHI+20000,
		34,		//のしかかり
		219,		//しんぴのまもり
		242,		//かみくだく
		37,		//あばれる
		83,		//ほのおのうず
		336,		//とおぼえ
		257,		//ねっぷう
		38,		//すてみタックル
		394,		//フレアドライブ
		MONSNO_NYOROMO+20000,
		54,		//しろいきり
		150,		//はねる
		61,		//バブルこうせん
		114,		//くろいきり
		170,		//こころのめ
		346,		//みずあそび
		301,		//アイスボール
		341,		//マッドショット
		287,		//リフレッシュ
		283,		//がむしゃら
		MONSNO_KEESHI+20000,
		227,		//アンコール
		112,		//バリアー
		282,		//はたきおとす
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		379,		//パワートリック
		385,		//ガードスワップ
		MONSNO_WANRIKII+20000,
		113,		//ひかりのかべ
		96,		//ヨガのポーズ
		27,		//まわしげり
		227,		//アンコール
		265,		//きつけ
		68,		//カウンター
		157,		//いわなだれ
		370,		//インファイト
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		418,		//バレットパンチ
		MONSNO_MADATUBOMI+20000,
		14,		//つるぎのまい
		227,		//アンコール
		115,		//リフレクター
		235,		//こうごうせい
		141,		//きゅうけつ
		275,		//ねをはる
		345,		//マジカルリーフ
		388,		//なやみのタネ
		321,		//くすぐる
		MONSNO_MENOKURAGE+20000,
		62,		//オーロラビーム
		243,		//ミラーコート
		229,		//こうそくスピン
		114,		//くろいきり
		219,		//しんぴのまもり
		109,		//あやしいひかり
		282,		//はたきおとす
		367,		//つぼをつく
		MONSNO_ISITUBUTE+20000,
		5,		//メガトンパンチ
		157,		//いわなだれ
		335,		//とおせんぼう
		359,		//アームハンマー
		175,		//じたばた
		MONSNO_PONIITA+20000,
		172,		//かえんぐるま
		37,		//あばれる
		24,		//にどげり
		95,		//さいみんじゅつ
		204,		//あまえる
		38,		//すてみタックル
		32,		//つのドリル
		MONSNO_YADON+20000,
		219,		//しんぴのまもり
		187,		//はらだいこ
		248,		//みらいよち
		23,		//ふみつけ
		300,		//どろあそび
		214,		//ねごと
		173,		//いびき
		382,		//さきどり
		335,		//とおせんぼう
		428,		//しねんのずつき
		MONSNO_KAMONEGI+20000,
		211,		//はがねのつばさ
		193,		//みやぶる
		119,		//オウムがえし
		16,		//かぜおこし
		98,		//でんこうせっか
		175,		//じたばた
		297,		//フェザーダンス
		174,		//のろい
		343,		//ほしがる
		189,		//どろかけ
		400,		//つじぎり
		MONSNO_DOODOO+20000,
		98,		//でんこうせっか
		48,		//ちょうおんぱ
		114,		//くろいきり
		185,		//だましうち
		175,		//じたばた
		283,		//がむしゃら
		119,		//オウムがえし
		413,		//ブレイブバード
		MONSNO_PAUWAU+20000,
		122,		//したでなめる
		195,		//ほろびのうた
		50,		//かなしばり
		32,		//つのドリル
		21,		//たたきつける
		227,		//アンコール
		252,		//ねこだまし
		333,		//つららばり
		324,		//シグナルビーム
		MONSNO_BETOBETAA+20000,
		114,		//くろいきり
		212,		//くろいまなざし
		122,		//したでなめる
		286,		//ふういん
		174,		//のろい
		325,		//シャドーパンチ
		153,		//だいばくはつ
		425,		//かげうち
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		MONSNO_SHERUDAA+20000,
		61,		//バブルこうせん
		36,		//とっしん
		112,		//バリアー
		229,		//こうそくスピン
		103,		//いやなおと
		333,		//つららばり
		341,		//マッドショット
		MONSNO_GOOSU+20000,
		149,		//サイコウェーブ
		195,		//ほろびのうた
		114,		//くろいきり
		310,		//おどろかす
		261,		//おにび
		288,		//おんねん
		153,		//だいばくはつ
		7,		//ほのおのパンチ
		8,		//れいとうパンチ
		9,		//かみなりパンチ
		MONSNO_IWAAKU+20000,
		157,		//いわなだれ
		175,		//じたばた
		153,		//だいばくはつ
		335,		//とおせんぼう
		111,		//まるくなる
		205,		//ころがる
		350,		//ロックブラスト
		MONSNO_SURIIPU+20000,
		112,		//バリアー
		274,		//ねこのて
		272,		//なりきり
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		417,		//わるだくみ
		260,		//おだてる
		427,		//サイコカッター
		MONSNO_KURABU+20000,
		91,		//あなをほる
		114,		//くろいきり
		133,		//ドわすれ
		175,		//じたばた
		21,		//たたきつける
		282,		//はたきおとす
		14,		//つるぎのまい
		321,		//くすぐる
		246,		//げんしのちから
		MONSNO_TAMATAMA+20000,
		235,		//こうごうせい
		236,		//つきのひかり
		115,		//リフレクター
		246,		//げんしのちから
		244,		//じこあんじ
		275,		//ねをはる
		174,		//のろい
		267,		//しぜんのちから
		381,		//おまじない
		437,		//リーフストーム
		MONSNO_KARAKARA+20000,
		157,		//いわなだれ
		246,		//げんしのちから
		187,		//はらだいこ
		103,		//いやなおと
		130,		//ロケットずつき
		195,		//ほろびのうた
		14,		//つるぎのまい
		24,		//にどげり
		442,		//アイアンヘッド
		MONSNO_BERORINGA+20000,
		187,		//はらだいこ
		222,		//マグニチュード
		34,		//のしかかり
		174,		//のろい
		265,		//きつけ
		214,		//ねごと
		173,		//いびき
		164,		//みがわり
		133,		//ドわすれ
		359,		//アームハンマー
		MONSNO_DOGAASU+20000,
		103,		//いやなおと
		149,		//サイコウェーブ
		60,		//サイケこうせん
		194,		//みちづれ
		220,		//いたみわけ
		261,		//おにび
		288,		//おんねん
		180,		//うらみ
		174,		//のろい
		MONSNO_SAIHOON+20000,
		242,		//かみくだく
		179,		//きしかいせい
		157,		//いわなだれ
		68,		//カウンター
		222,		//マグニチュード
		14,		//つるぎのまい
		174,		//のろい
		306,		//ブレイククロー
		407,		//ドラゴンダイブ
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		MONSNO_RAKKII+20000,
		217,		//プレゼント
		118,		//ゆびをふる
		215,		//いやしのすず
		312,		//アロマセラピー
		164,		//みがわり
		68,		//カウンター
		270,		//てだすけ
		356,		//じゅうりょく
		MONSNO_MONZYARA+20000,
		175,		//じたばた
		93,		//ねんりき
		72,		//メガドレイン
		115,		//リフレクター
		133,		//ドわすれ
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		283,		//がむしゃら
		437,		//リーフストーム
		MONSNO_GARUURA+20000,
		23,		//ふみつけ
		193,		//みやぶる
		116,		//きあいだめ
		219,		//しんぴのまもり
		50,		//かなしばり
		68,		//カウンター
		306,		//ブレイククロー
		164,		//みがわり
		38,		//すてみタックル
		283,		//がむしゃら
		359,		//アームハンマー
		MONSNO_TATTUU+20000,
		175,		//じたばた
		62,		//オーロラビーム
		190,		//オクタンほう
		50,		//かなしばり
		150,		//はねる
		82,		//りゅうのいかり
		225,		//りゅうのいぶき
		324,		//シグナルビーム
		MONSNO_TOSAKINTO+20000,
		60,		//サイケこうせん
		114,		//くろいきり
		56,		//ハイドロポンプ
		214,		//ねごと
		300,		//どろあそび
		189,		//どろかけ
		401,		//アクアテール
		MONSNO_BARIYAADO+20000,
		248,		//みらいよち
		95,		//さいみんじゅつ
		102,		//ものまね
		244,		//じこあんじ
		252,		//ねこだまし
		271,		//トリック
		109,		//あやしいひかり
		358,		//めざましビンタ
		298,		//フラフラダンス
		MONSNO_SUTORAIKU+20000,
		68,		//カウンター
		219,		//しんぴのまもり
		226,		//バトンタッチ
		13,		//かまいたち
		179,		//きしかいせい
		113,		//ひかりのかべ
		203,		//こらえる
		318,		//ぎんいろのかぜ
		405,		//むしのさざめき
		400,		//つじぎり
		MONSNO_KAIROSU+20000,
		31,		//みだれづき
		175,		//じたばた
		206,		//みねうち
		185,		//だましうち
		98,		//でんこうせっか
		370,		//インファイト
		364,		//フェイント
		MONSNO_RAPURASU+20000,
		193,		//みやぶる
		164,		//みがわり
		321,		//くすぐる
		287,		//リフレッシュ
		349,		//りゅうのまい
		174,		//のろい
		214,		//ねごと
		32,		//つのドリル
		246,		//げんしのちから
		250,		//うずしお
		90,		//じわれ
		MONSNO_IIBUI+20000,
		204,		//あまえる
		175,		//じたばた
		203,		//こらえる
		174,		//のろい
		321,		//くすぐる
		273,		//ねがいごと
		281,		//あくび
		313,		//うそなき
		343,		//ほしがる
		MONSNO_OMUNAITO+20000,
		61,		//バブルこうせん
		62,		//オーロラビーム
		21,		//たたきつける
		48,		//ちょうおんぱ
		114,		//くろいきり
		157,		//いわなだれ
		191,		//まきびし
		282,		//はたきおとす
		378,		//しぼりとる
		390,		//どくびし
		MONSNO_KABUTO+20000,
		61,		//バブルこうせん
		62,		//オーロラビーム
		229,		//こうそくスピン
		91,		//あなをほる
		175,		//じたばた
		282,		//はたきおとす
		109,		//あやしいひかり
		341,		//マッドショット
		196,		//こごえるかぜ
		103,		//いやなおと
		MONSNO_PUTERA+20000,
		18,		//ふきとばし
		228,		//おいうち
		193,		//みやぶる
		211,		//はがねのつばさ
		225,		//りゅうのいぶき
		174,		//のろい
		372,		//ダメおし
		MONSNO_KABIGON+20000,
		122,		//したでなめる
		204,		//あまえる
		38,		//すてみタックル
		174,		//のろい
		90,		//じわれ
		164,		//みがわり
		18,		//ふきとばし
		228,		//おいうち
		MONSNO_MINIRYUU+20000,
		113,		//ひかりのかべ
		54,		//しろいきり
		114,		//くろいきり
		48,		//ちょうおんぱ
		225,		//りゅうのいぶき
		349,		//りゅうのまい
		407,		//ドラゴンダイブ
		MONSNO_TIKORIITA+20000,
		22,		//つるのムチ
		73,		//やどりぎのタネ
		68,		//カウンター
		246,		//げんしのちから
		175,		//じたばた
		267,		//しぜんのちから
		275,		//ねをはる
		320,		//くさぶえ
		437,		//リーフストーム
		312,		//アロマセラピー
		378,		//しぼりとる
		MONSNO_HINOARASI+20000,
		154,		//みだれひっかき
		98,		//でんこうせっか
		179,		//きしかいせい
		37,		//あばれる
		193,		//みやぶる
		343,		//ほしがる
		336,		//とおぼえ
		306,		//ブレイククロー
		38,		//すてみタックル
		24,		//にどげり
		394,		//フレアドライブ
		MONSNO_WANINOKO+20000,
		242,		//かみくだく
		37,		//あばれる
		56,		//ハイドロポンプ
		246,		//げんしのちから
		157,		//いわなだれ
		300,		//どろあそび
		346,		//みずあそび
		337,		//ドラゴンクロー
		8,		//れいとうパンチ
		232,		//メタルクロー
		349,		//りゅうのまい
		MONSNO_OTATI+20000,
		38,		//すてみタックル
		228,		//おいうち
		163,		//きりさく
		116,		//きあいだめ
		179,		//きしかいせい
		164,		//みがわり
		271,		//トリック
		274,		//ねこのて
		387,		//とっておき
		204,		//あまえる
		343,		//ほしがる
		MONSNO_HOOHOO+20000,
		119,		//オウムがえし
		48,		//ちょうおんぱ
		185,		//だましうち
		17,		//つばさでうつ
		18,		//ふきとばし
		143,		//ゴッドバード
		297,		//フェザーダンス
		97,		//こうそくいどう
		101,		//ナイトヘッド
		MONSNO_REDHIBA+20000,
		60,		//サイケこうせん
		117,		//がまん
		318,		//ぎんいろのかぜ
		405,		//むしのさざめき
		103,		//いやなおと
		227,		//アンコール
		282,		//はたきおとす
		450,		//むしくい
		MONSNO_ITOMARU+20000,
		60,		//サイケこうせん
		50,		//かなしばり
		49,		//ソニックブーム
		226,		//バトンタッチ
		228,		//おいうち
		324,		//シグナルビーム
		390,		//どくびし
		398,		//どくづき
		MONSNO_TYONTII+20000,
		175,		//じたばた
		103,		//いやなおと
		133,		//ドわすれ
		60,		//サイケこうせん
		250,		//うずしお
		97,		//こうそくいどう
		54,		//しろいきり
		MONSNO_PITYUU+20000,
		179,		//きしかいせい
		117,		//がまん
		217,		//プレゼント
		227,		//アンコール
		3,		//おうふくビンタ
		273,		//ねがいごと
		268,		//じゅうでん
		252,		//ねこだまし
		9,		//かみなりパンチ
		321,		//くすぐる
		MONSNO_PHI+20000,
		217,		//プレゼント
		118,		//ゆびをふる
		133,		//ドわすれ
		187,		//はらだいこ
		150,		//はねる
		102,		//ものまね
		273,		//ねがいごと
		164,		//みがわり
		313,		//うそなき
		343,		//ほしがる
		MONSNO_PUPURIN+20000,
		195,		//ほろびのうた
		217,		//プレゼント
		185,		//だましうち
		273,		//ねがいごと
		313,		//うそなき
		387,		//とっておき
		343,		//ほしがる
		356,		//じゅうりょく
		MONSNO_TOGEPII+20000,
		217,		//プレゼント
		119,		//オウムがえし
		64,		//つつく
		193,		//みやぶる
		248,		//みらいよち
		164,		//みがわり
		244,		//じこあんじ
		417,		//わるだくみ
		375,		//サイコシフト
		381,		//おまじない
		MONSNO_NEITHI+20000,
		114,		//くろいきり
		65,		//ドリルくちばし
		98,		//でんこうせっか
		185,		//だましうち
		211,		//はがねのつばさ
		244,		//じこあんじ
		297,		//フェザーダンス
		287,		//リフレッシュ
		428,		//しねんのずつき
		389,		//ふいうち
		MONSNO_MERIIPU+20000,
		36,		//とっしん
		34,		//のしかかり
		219,		//しんぴのまもり
		103,		//いやなおと
		115,		//リフレクター
		316,		//かぎわける
		268,		//じゅうでん
		260,		//おだてる
		28,		//すなかけ
		MONSNO_MARIRU+20000,
		113,		//ひかりのかべ
		217,		//プレゼント
		133,		//ドわすれ
		248,		//みらいよち
		187,		//はらだいこ
		195,		//ほろびのうた
		48,		//ちょうおんぱ
		164,		//みがわり
		453,		//アクアジェット
		276,		//ばかぢから
		287,		//リフレッシュ
		MONSNO_USOKKII+20000,
		120,		//じばく
		29,		//ずつき
		106,		//かたくなる
		111,		//まるくなる
		205,		//ころがる
		328,		//すなじごく
		MONSNO_HANEKKO+20000,
		93,		//ねんりき
		227,		//アンコール
		38,		//すてみタックル
		115,		//リフレクター
		133,		//ドわすれ
		270,		//てだすけ
		244,		//じこあんじ
		312,		//アロマセラピー
		388,		//なやみのタネ
		MONSNO_EIPAMU+20000,
		68,		//カウンター
		103,		//いやなおと
		228,		//おいうち
		97,		//こうそくいどう
		180,		//うらみ
		21,		//たたきつける
		3,		//おうふくビンタ
		251,		//ふくろだたき
		252,		//ねこだまし
		343,		//ほしがる
		340,		//とびはねる
		MONSNO_HIMANATTU+20000,
		320,		//くさぶえ
		227,		//アンコール
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		174,		//のろい
		270,		//てだすけ
		275,		//ねをはる
		230,		//あまいかおり
		MONSNO_YANYANMA+20000,
		18,		//ふきとばし
		179,		//きしかいせい
		141,		//きゅうけつ
		324,		//シグナルビーム
		318,		//ぎんいろのかぜ
		364,		//フェイント
		185,		//だましうち
		228,		//おいうち
		MONSNO_UPAA+20000,
		34,		//のしかかり
		246,		//げんしのちから
		219,		//しんぴのまもり
		174,		//のろい
		300,		//どろあそび
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		68,		//カウンター
		227,		//アンコール
		24,		//にどげり
		MONSNO_YAMIKARASU+20000,
		18,		//ふきとばし
		65,		//ドリルくちばし
		119,		//オウムがえし
		17,		//つばさでうつ
		143,		//ゴッドバード
		109,		//あやしいひかり
		297,		//フェザーダンス
		195,		//ほろびのうた
		375,		//サイコシフト
		103,		//いやなおと
		185,		//だましうち
		MONSNO_MUUMA+20000,
		103,		//いやなおと
		194,		//みちづれ
		244,		//じこあんじ
		286,		//ふういん
		262,		//おきみやげ
		389,		//ふいうち
		425,		//かげうち
		174,		//のろい
		180,		//うらみ
		466,		//あやしいかぜ
		MONSNO_KIRINRIKI+20000,
		36,		//とっしん
		133,		//ドわすれ
		193,		//みやぶる
		248,		//みらいよち
		251,		//ふくろだたき
		244,		//じこあんじ
		273,		//ねがいごと
		277,		//マジックコート
		24,		//にどげり
		243,		//ミラーコート
		MONSNO_KUNUGIDAMA+20000,
		115,		//リフレクター
		42,		//ミサイルばり
		175,		//じたばた
		129,		//スピードスター
		68,		//カウンター
		328,		//すなじごく
		279,		//リベンジ
		38,		//すてみタックル
		390,		//どくびし
		MONSNO_NOKOTTI+20000,
		117,		//がまん
		246,		//げんしのちから
		157,		//いわなだれ
		44,		//かみつく
		29,		//ずつき
		310,		//おどろかす
		174,		//のろい
		376,		//きりふだ
		277,		//マジックコート
		173,		//いびき
		MONSNO_GURAIGAA+20000,
		232,		//メタルクロー
		17,		//つばさでうつ
		13,		//かまいたち
		68,		//カウンター
		328,		//すなじごく
		97,		//こうそくいどう
		226,		//バトンタッチ
		38,		//すてみタックル
		364,		//フェイント
		400,		//つじぎり
		440,		//クロスポイズン
		MONSNO_BURUU+20000,
		118,		//ゆびをふる
		185,		//だましうち
		115,		//リフレクター
		217,		//プレゼント
		242,		//かみくだく
		215,		//いやしのすず
		173,		//いびき
		265,		//きつけ
		370,		//インファイト
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		MONSNO_HARIISEN+20000,
		175,		//じたばた
		114,		//くろいきり
		61,		//バブルこうせん
		48,		//ちょうおんぱ
		310,		//おどろかす
		324,		//シグナルビーム
		398,		//どくづき
		MONSNO_TUBOTUBO+20000,
		230,		//あまいかおり
		282,		//はたきおとす
		270,		//てだすけ
		367,		//つぼをつく
		328,		//すなじごく
		189,		//どろかけ
		MONSNO_HERAKUROSU+20000,
		106,		//かたくなる
		117,		//がまん
		175,		//じたばた
		206,		//みねうち
		279,		//リベンジ
		228,		//おいうち
		38,		//すてみタックル
		MONSNO_NYUURA+20000,
		68,		//カウンター
		180,		//うらみ
		193,		//みやぶる
		115,		//リフレクター
		44,		//かみつく
		306,		//ブレイククロー
		252,		//ねこだまし
		458,		//ダブルアタック
		386,		//おしおき
		228,		//おいうち
		420,		//こおりのつぶて
		8,		//れいとうパンチ
		MONSNO_HIMEGUMA+20000,
		242,		//かみくだく
		36,		//とっしん
		69,		//ちきゅうなげ
		68,		//カウンター
		232,		//メタルクロー
		313,		//うそなき
		281,		//あくび
		214,		//ねごと
		238,		//クロスチョップ
		38,		//すてみタックル
		370,		//インファイト
		400,		//つじぎり
		MONSNO_MAGUMAGGU+20000,
		151,		//とける
		257,		//ねっぷう
		174,		//のろい
		108,		//えんまく
		262,		//おきみやげ
		254,		//たくわえる
		255,		//はきだす
		256,		//のみこむ
		MONSNO_URIMUU+20000,
		36,		//とっしん
		44,		//かみつく
		34,		//のしかかり
		157,		//いわなだれ
		246,		//げんしのちから
		341,		//マッドショット
		333,		//つららばり
		38,		//すてみタックル
		90,		//じわれ
		174,		//のろい
		MONSNO_SANIIGO+20000,
		157,		//いわなだれ
		103,		//いやなおと
		54,		//しろいきり
		133,		//ドわすれ
		112,		//バリアー
		275,		//ねをはる
		109,		//あやしいひかり
		333,		//つららばり
		267,		//しぜんのちから
		392,		//アクアリング
		MONSNO_TEPPOUO+20000,
		62,		//オーロラビーム
		190,		//オクタンほう
		48,		//ちょうおんぱ
		114,		//くろいきり
		103,		//いやなおと
		86,		//でんじは
		350,		//ロックブラスト
		173,		//いびき
		175,		//じたばた
		MONSNO_DERIBAADO+20000,
		62,		//オーロラビーム
		98,		//でんこうせっか
		248,		//みらいよち
		150,		//はねる
		229,		//こうそくスピン
		301,		//アイスボール
		420,		//こおりのつぶて
		8,		//れいとうパンチ
		MONSNO_MANTAIN+20000,
		239,		//たつまき
		56,		//ハイドロポンプ
		114,		//くろいきり
		21,		//たたきつける
		300,		//どろあそび
		157,		//いわなだれ
		243,		//ミラーコート
		346,		//みずあそび
		150,		//はねる
		MONSNO_EAAMUDO+20000,
		65,		//ドリルくちばし
		228,		//おいうち
		18,		//ふきとばし
		143,		//ゴッドバード
		174,		//のろい
		413,		//ブレイブバード
		372,		//ダメおし
		MONSNO_DERUBIRU+20000,
		83,		//ほのおのうず
		99,		//いかり
		228,		//おいうち
		68,		//カウンター
		180,		//うらみ
		179,		//きしかいせい
		251,		//ふくろだたき
		261,		//おにび
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		417,		//わるだくみ
		386,		//おしおき
		MONSNO_GOMAZOU+20000,
		116,		//きあいだめ
		34,		//のしかかり
		246,		//げんしのちから
		173,		//いびき
		68,		//カウンター
		90,		//じわれ
		283,		//がむしゃら
		420,		//こおりのつぶて
		MONSNO_ODOSISI+20000,
		180,		//うらみ
		50,		//かなしばり
		44,		//かみつく
		207,		//いばる
		244,		//じこあんじ
		326,		//じんつうりき
		37,		//あばれる
		24,		//にどげり
		428,		//しねんのずつき
		MONSNO_BARUKII+20000,
		229,		//こうそくスピン
		136,		//とびひざげり
		183,		//マッハパンチ
		170,		//こころのめ
		270,		//てだすけ
		68,		//カウンター
		410,		//しんくうは
		418,		//バレットパンチ
		MONSNO_MUTYUURU+20000,
		96,		//ヨガのポーズ
		244,		//じこあんじ
		252,		//ねこだまし
		273,		//ねがいごと
		8,		//れいとうパンチ
		357,		//ミラクルアイ
		MONSNO_EREKIDDO+20000,
		2,		//からてチョップ
		112,		//バリアー
		27,		//まわしげり
		96,		//ヨガのポーズ
		238,		//クロスチョップ
		7,		//ほのおのパンチ
		8,		//れいとうパンチ
		223,		//ばくれつパンチ
		MONSNO_BUBHI+20000,
		2,		//からてチョップ
		5,		//メガトンパンチ
		112,		//バリアー
		103,		//いやなおと
		238,		//クロスチョップ
		9,		//かみなりパンチ
		183,		//マッハパンチ
		223,		//ばくれつパンチ
		394,		//フレアドライブ
		MONSNO_MIRUTANKU+20000,
		217,		//プレゼント
		179,		//きしかいせい
		69,		//ちきゅうなげ
		203,		//こらえる
		244,		//じこあんじ
		174,		//のろい
		270,		//てだすけ
		214,		//ねごと
		146,		//ピヨピヨパンチ
		359,		//アームハンマー
		38,		//すてみタックル
		386,		//おしおき
		MONSNO_YOOGIRASU+20000,
		228,		//おいうち
		23,		//ふみつけ
		200,		//げきりん
		116,		//きあいだめ
		246,		//げんしのちから
		349,		//りゅうのまい
		174,		//のろい
		334,		//てっぺき
		372,		//ダメおし
		442,		//アイアンヘッド
		MONSNO_KIMORI+20000,
		242,		//かみくだく
		300,		//どろあそび
		283,		//がむしゃら
		73,		//やどりぎのタネ
		225,		//りゅうのいぶき
		306,		//ブレイククロー
		388,		//なやみのタネ
		24,		//にどげり
		320,		//くさぶえ
		235,		//こうごうせい
		345,		//マジカルリーフ
		437,		//リーフストーム
		MONSNO_ATYAMO+20000,
		68,		//カウンター
		179,		//きしかいせい
		203,		//こらえる
		207,		//いばる
		157,		//いわなだれ
		265,		//きつけ
		306,		//ブレイククロー
		226,		//バトンタッチ
		97,		//こうそくいどう
		400,		//つじぎり
		387,		//とっておき
		364,		//フェイント
		MONSNO_MIZUGOROU+20000,
		287,		//リフレッシュ
		253,		//さわぐ
		174,		//のろい
		23,		//ふみつけ
		301,		//アイスボール
		243,		//ミラーコート
		68,		//カウンター
		246,		//げんしのちから
		250,		//うずしお
		44,		//かみつく
		38,		//すてみタックル
		426,		//どろばくだん
		MONSNO_POTIENA+20000,
		310,		//おどろかす
		305,		//どくどくのキバ
		343,		//ほしがる
		43,		//にらみつける
		281,		//あくび
		389,		//ふいうち
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		382,		//さきどり
		MONSNO_ZIGUZAGUMA+20000,
		204,		//あまえる
		228,		//おいうち
		164,		//みがわり
		321,		//くすぐる
		271,		//トリック
		270,		//てだすけ
		189,		//どろかけ
		MONSNO_HASUBOO+20000,
		235,		//こうごうせい
		75,		//はっぱカッター
		230,		//あまいかおり
		73,		//やどりぎのタネ
		175,		//じたばた
		55,		//みずでっぽう
		321,		//くすぐる
		MONSNO_TANEBOO+20000,
		73,		//やどりぎのタネ
		133,		//ドわすれ
		98,		//でんこうせっか
		13,		//かまいたち
		36,		//とっしん
		206,		//みねうち
		388,		//なやみのタネ
		417,		//わるだくみ
		MONSNO_SUBAME+20000,
		228,		//おいうち
		48,		//ちょうおんぱ
		287,		//リフレッシュ
		119,		//オウムがえし
		99,		//いかり
		143,		//ゴッドバード
		18,		//ふきとばし
		413,		//ブレイブバード
		MONSNO_KYAMOME+20000,
		54,		//しろいきり
		239,		//たつまき
		97,		//こうそくいどう
		16,		//かぜおこし
		346,		//みずあそび
		392,		//アクアリング
		282,		//はたきおとす
		MONSNO_RARUTOSU+20000,
		50,		//かなしばり
		261,		//おにび
		212,		//くろいまなざし
		262,		//おきみやげ
		194,		//みちづれ
		288,		//おんねん
		425,		//かげうち
		109,		//あやしいひかり
		MONSNO_AMETAMA+20000,
		193,		//みやぶる
		341,		//マッドショット
		60,		//サイケこうせん
		56,		//ハイドロポンプ
		170,		//こころのめ
		324,		//シグナルビーム
		450,		//むしくい
		MONSNO_KINOKOKO+20000,
		313,		//うそなき
		207,		//いばる
		204,		//あまえる
		206,		//みねうち
		270,		//てだすけ
		388,		//なやみのタネ
		358,		//めざましビンタ
		402,		//タネばくだん
		MONSNO_NAMAKERO+20000,
		228,		//おいうち
		163,		//きりさく
		34,		//のしかかり
		173,		//いびき
		306,		//ブレイククロー
		174,		//のろい
		214,		//ねごと
		359,		//アームハンマー
		400,		//つじぎり
		MONSNO_TUTININ+20000,
		203,		//こらえる
		185,		//だましうち
		16,		//かぜおこし
		318,		//ぎんいろのかぜ
		405,		//むしのさざめき
		400,		//つじぎり
		450,		//むしくい
		MONSNO_GONYONYO+20000,
		36,		//とっしん
		173,		//いびき
		207,		//いばる
		326,		//じんつうりき
		265,		//きつけ
		108,		//えんまく
		283,		//がむしゃら
		MONSNO_MAKUNOSITA+20000,
		185,		//だましうち
		197,		//みきり
		193,		//みやぶる
		270,		//てだすけ
		238,		//クロスチョップ
		279,		//リベンジ
		223,		//ばくれつパンチ
		68,		//カウンター
		358,		//めざましビンタ
		418,		//バレットパンチ
		MONSNO_RURIRI+20000,
		227,		//アンコール
		47,		//うたう
		287,		//リフレッシュ
		21,		//たたきつける
		321,		//くすぐる
		313,		//うそなき
		MONSNO_NOZUPASU+20000,
		222,		//マグニチュード
		205,		//ころがる
		153,		//だいばくはつ
		38,		//すてみタックル
		335,		//とおせんぼう
		MONSNO_ENEKO+20000,
		270,		//てだすけ
		244,		//じこあんじ
		253,		//さわぐ
		313,		//うそなき
		273,		//ねがいごと
		226,		//バトンタッチ
		164,		//みがわり
		321,		//くすぐる
		387,		//とっておき
		252,		//ねこだまし
		428,		//しねんのずつき
		389,		//ふいうち
		MONSNO_YAMIRAMI+20000,
		244,		//じこあんじ
		105,		//じこさいせい
		236,		//つきのひかり
		417,		//わるだくみ
		260,		//おだてる
		MONSNO_KUTIITO+20000,
		14,		//つるぎのまい
		206,		//みねうち
		305,		//どくどくのキバ
		244,		//じこあんじ
		246,		//げんしのちから
		321,		//くすぐる
		389,		//ふいうち
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		386,		//おしおき
		MONSNO_KOKODORA+20000,
		283,		//がむしゃら
		34,		//のしかかり
		23,		//ふみつけ
		265,		//きつけ
		174,		//のろい
		103,		//いやなおと
		442,		//アイアンヘッド
		407,		//ドラゴンダイブ
		MONSNO_ASANAN+20000,
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		193,		//みやぶる
		252,		//ねこだまし
		226,		//バトンタッチ
		223,		//ばくれつパンチ
		384,		//パワースワップ
		385,		//ガードスワップ
		427,		//サイコカッター
		418,		//バレットパンチ
		MONSNO_RAKURAI+20000,
		242,		//かみくだく
		29,		//ずつき
		253,		//さわぐ
		174,		//のろい
		129,		//スピードスター
		435,		//ほうでん
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		MONSNO_PURASURU+20000,
		164,		//みがわり
		273,		//ねがいごと
		47,		//うたう
		186,		//てんしのキッス
		MONSNO_MAINAN+20000,
		164,		//みがわり
		273,		//ねがいごと
		47,		//うたう
		186,		//てんしのキッス
		MONSNO_BARUBIITO+20000,
		226,		//バトンタッチ
		318,		//ぎんいろのかぜ
		271,		//トリック
		227,		//アンコール
		405,		//むしのさざめき
		MONSNO_IRUMIIZE+20000,
		226,		//バトンタッチ
		318,		//ぎんいろのかぜ
		74,		//せいちょう
		227,		//アンコール
		405,		//むしのさざめき
		MONSNO_ROZERIA+20000,
		191,		//まきびし
		235,		//こうごうせい
		42,		//ミサイルばり
		178,		//わたほうし
		79,		//ねむりごな
		75,		//はっぱカッター
		170,		//こころのめ
		437,		//リーフストーム
		MONSNO_GOKURIN+20000,
		138,		//ゆめくい
		151,		//とける
		123,		//スモッグ
		220,		//いたみわけ
		174,		//のろい
		194,		//みちづれ
		MONSNO_KIBANIA+20000,
		56,		//ハイドロポンプ
		38,		//すてみタックル
		37,		//あばれる
		246,		//げんしのちから
		MONSNO_HOERUKO+20000,
		38,		//すてみタックル
		37,		//あばれる
		207,		//いばる
		173,		//いびき
		214,		//ねごと
		174,		//のろい
		90,		//じわれ
		321,		//くすぐる
		111,		//まるくなる
		34,		//のしかかり
		MONSNO_DONMERU+20000,
		336,		//とおぼえ
		184,		//こわいかお
		34,		//のしかかり
		205,		//ころがる
		111,		//まるくなる
		23,		//ふみつけ
		281,		//あくび
		246,		//げんしのちから
		426,		//どろばくだん
		257,		//ねっぷう
		MONSNO_KOOTASU+20000,
		284,		//ふんか
		203,		//こらえる
		214,		//ねごと
		281,		//あくび
		89,		//じしん
		90,		//じわれ
		MONSNO_BANEBUU+20000,
		248,		//みらいよち
		326,		//じんつうりき
		164,		//みがわり
		271,		//トリック
		428,		//しねんのずつき
		133,		//ドわすれ
		243,		//ミラーコート
		MONSNO_PATTIIRU+20000,
		227,		//アンコール
		157,		//いわなだれ
		274,		//ねこのて
		50,		//かなしばり
		226,		//バトンタッチ
		273,		//ねがいごと
		271,		//トリック
		265,		//きつけ
		252,		//ねこだまし
		272,		//なりきり
		427,		//サイコカッター
		MONSNO_NAKKURAA+20000,
		116,		//きあいだめ
		98,		//でんこうせっか
		16,		//かぜおこし
		175,		//じたばた
		210,		//れんぞくぎり
		MONSNO_SABONEA+20000,
		320,		//くさぶえ
		51,		//ようかいえき
		298,		//フラフラダンス
		223,		//ばくれつパンチ
		68,		//カウンター
		67,		//けたぐり
		265,		//きつけ
		345,		//マジカルリーフ
		402,		//タネばくだん
		MONSNO_TIRUTTO+20000,
		97,		//こうそくいどう
		114,		//くろいきり
		228,		//おいうち
		99,		//いかり
		297,		//フェザーダンス
		407,		//ドラゴンダイブ
		MONSNO_ZANGUUSU+20000,
		175,		//じたばた
		24,		//にどげり
		13,		//かまいたち
		68,		//カウンター
		46,		//ほえる
		174,		//のろい
		154,		//みだれひっかき
		400,		//つじぎり
		232,		//メタルクロー
		458,		//ダブルアタック
		MONSNO_HABUNEEKU+20000,
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		34,		//のしかかり
		184,		//こわいかお
		372,		//ダメおし
		400,		//つじぎり
		MONSNO_DOZYOTTI+20000,
		37,		//あばれる
		250,		//うずしお
		209,		//スパーク
		56,		//ハイドロポンプ
		175,		//じたばた
		36,		//とっしん
		MONSNO_HEIGANI+20000,
		300,		//どろあそび
		283,		//がむしゃら
		34,		//のしかかり
		246,		//げんしのちから
		282,		//はたきおとす
		276,		//ばかぢから
		232,		//メタルクロー
		MONSNO_RIRIIRA+20000,
		112,		//バリアー
		105,		//じこさいせい
		243,		//ミラーコート
		157,		//いわなだれ
		378,		//しぼりとる
		321,		//くすぐる
		MONSNO_ANOPUSU+20000,
		229,		//こうそくスピン
		282,		//はたきおとす
		14,		//つるぎのまい
		157,		//いわなだれ
		103,		//いやなおと
		28,		//すなかけ
		440,		//クロスポイズン
		MONSNO_HINBASU+20000,
		243,		//ミラーコート
		225,		//りゅうのいぶき
		300,		//どろあそび
		95,		//さいみんじゅつ
		113,		//ひかりのかべ
		109,		//あやしいひかり
		54,		//しろいきり
		114,		//くろいきり
		321,		//くすぐる
		MONSNO_POWARUN+20000,
		248,		//みらいよち
		244,		//じこあんじ
		381,		//おまじない
		50,		//かなしばり
		133,		//ドわすれ
		466,		//あやしいかぜ
		MONSNO_KAKUREON+20000,
		50,		//かなしばり
		277,		//マジックコート
		271,		//トリック
		252,		//ねこだまし
		417,		//わるだくみ
		146,		//ピヨピヨパンチ
		MONSNO_KAGEBOUZU+20000,
		50,		//かなしばり
		194,		//みちづれ
		193,		//みやぶる
		310,		//おどろかす
		286,		//ふういん
		228,		//おいうち
		425,		//かげうち
		371,		//しっぺがえし
		109,		//あやしいひかり
		MONSNO_YOMAWARU+20000,
		286,		//ふういん
		194,		//みちづれ
		220,		//いたみわけ
		288,		//おんねん
		262,		//おきみやげ
		185,		//だましうち
		466,		//あやしいかぜ
		MONSNO_TOROPIUSU+20000,
		29,		//ずつき
		21,		//たたきつける
		13,		//かまいたち
		73,		//やどりぎのタネ
		267,		//しぜんのちから
		437,		//リーフストーム
		235,		//こうごうせい
		174,		//のろい
		348,		//リーフブレード
		MONSNO_TIRIIN+20000,
		50,		//かなしばり
		174,		//のろい
		95,		//さいみんじゅつ
		138,		//ゆめくい
		273,		//ねがいごと
		248,		//みらいよち
		MONSNO_ABUSORU+20000,
		226,		//バトンタッチ
		185,		//だましうち
		38,		//すてみタックル
		277,		//マジックコート
		174,		//のろい
		164,		//みがわり
		212,		//くろいまなざし
		428,		//しねんのずつき
		386,		//おしおき
		389,		//ふいうち
		372,		//ダメおし
		382,		//さきどり
		MONSNO_YUKIWARASI+20000,
		335,		//とおせんぼう
		191,		//まきびし
		205,		//ころがる
		50,		//かなしばり
		117,		//がまん
		MONSNO_TAMAZARASI+20000,
		346,		//みずあそび
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		281,		//あくび
		157,		//いわなだれ
		174,		//のろい
		90,		//じわれ
		324,		//シグナルビーム
		MONSNO_PAARURU+20000,
		287,		//リフレッシュ
		300,		//どろあそび
		34,		//のしかかり
		48,		//ちょうおんぱ
		112,		//バリアー
		109,		//あやしいひかり
		392,		//アクアリング
		MONSNO_ZIIRANSU+20000,
		222,		//マグニチュード
		130,		//ロケットずつき
		346,		//みずあそび
		133,		//ドわすれ
		214,		//ねごと
		157,		//いわなだれ
		401,		//アクアテール
		173,		//いびき
		189,		//どろかけ
		MONSNO_RABUKASU+20000,
		150,		//はねる
		48,		//ちょうおんぱ
		346,		//みずあそび
		300,		//どろあそび
		445,		//ゆうわく
		392,		//アクアリング
		MONSNO_TATUBEI+20000,
		56,		//ハイドロポンプ
		37,		//あばれる
		82,		//りゅうのいかり
		239,		//たつまき
		349,		//りゅうのまい
		424,		//ほのおのキバ
		421,		//シャドークロー
		407,		//ドラゴンダイブ
		MONSNO_NAETORU+20000,
		388,		//なやみのタネ
		74,		//せいちょう
		321,		//くすぐる
		34,		//のしかかり
		38,		//すてみタックル
		328,		//すなじごく
		402,		//タネばくだん
		37,		//あばれる
		133,		//ドわすれ
		276,		//ばかぢから
		MONSNO_HIKOZARU+20000,
		7,		//ほのおのパンチ
		9,		//かみなりパンチ
		24,		//にどげり
		227,		//アンコール
		257,		//ねっぷう
		116,		//きあいだめ
		270,		//てだすけ
		252,		//ねこだまし
		299,		//ブレイズキック
		68,		//カウンター
		MONSNO_POTTYAMA+20000,
		458,		//ダブルアタック
		48,		//ちょうおんぱ
		281,		//あくび
		300,		//どろあそび
		189,		//どろかけ
		173,		//いびき
		175,		//じたばた
		97,		//こうそくいどう
		392,		//アクアリング
		56,		//ハイドロポンプ
		MONSNO_MUKUDORI+20000,
		297,		//フェザーダンス
		31,		//みだれづき
		228,		//おいうち
		310,		//おどろかす
		28,		//すなかけ
		193,		//みやぶる
		38,		//すてみタックル
		MONSNO_BIIBAA+20000,
		98,		//でんこうせっか
		346,		//みずあそび
		38,		//すてみタックル
		154,		//みだれひっかき
		111,		//まるくなる
		205,		//ころがる
		316,		//かぎわける
		401,		//アクアテール
		MONSNO_PATITI+20000,
		423,		//こおりのキバ
		424,		//ほのおのキバ
		422,		//かみなりのキバ
		98,		//でんこうせっか
		336,		//とおぼえ
		36,		//とっしん
		MONSNO_SUBOMII+20000,
		191,		//まきびし
		235,		//こうごうせい
		42,		//ミサイルばり
		178,		//わたほうし
		79,		//ねむりごな
		75,		//はっぱカッター
		170,		//こころのめ
		437,		//リーフストーム
		326,		//じんつうりき
		MONSNO_PATIKI+20000,
		242,		//かみくだく
		37,		//あばれる
		38,		//すてみタックル
		43,		//にらみつける
		21,		//たたきつける
		23,		//ふみつけ
		18,		//ふきとばし
		359,		//アームハンマー
		MONSNO_TATETOPUSU+20000,
		29,		//ずつき
		184,		//こわいかお
		116,		//きあいだめ
		38,		//すてみタックル
		350,		//ロックブラスト
		34,		//のしかかり
		103,		//いやなおと
		174,		//のろい
		90,		//じわれ
		MONSNO_PATIRISSU+20000,
		343,		//ほしがる
		44,		//かみつく
		313,		//うそなき
		111,		//まるくなる
		205,		//ころがる
		260,		//おだてる
		175,		//じたばた
		MONSNO_BUIZERU+20000,
		189,		//どろかけ
		29,		//ずつき
		154,		//みだれひっかき
		163,		//きりさく
		316,		//かぎわける
		3,		//おうふくビンタ
		210,		//れんぞくぎり
		226,		//バトンタッチ
		MONSNO_THERIRIN+20000,
		75,		//はっぱカッター
		230,		//あまいかおり
		321,		//くすぐる
		267,		//しぜんのちから
		320,		//くさぶえ
		312,		//アロマセラピー
		MONSNO_SIIUSI+20000,
		68,		//カウンター
		243,		//ミラーコート
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		281,		//あくび
		262,		//おきみやげ
		174,		//のろい
		133,		//ドわすれ
		90,		//じわれ
		MONSNO_HUUSEN+20000,
		262,		//おきみやげ
		34,		//のしかかり
		194,		//みちづれ
		50,		//かなしばり
		114,		//くろいきり
		95,		//さいみんじゅつ
		MONSNO_MIMITTO+20000,
		313,		//うそなき
		252,		//ねこだまし
		227,		//アンコール
		186,		//てんしのキッス
		458,		//ダブルアタック
		213,		//メロメロ
		67,		//けたぐり
		327,		//スカイアッパー
		415,		//すりかえ
		9,		//かみなりパンチ
		8,		//れいとうパンチ
		7,		//ほのおのパンチ
		MONSNO_RIZUMHI+20000,
		44,		//かみつく
		39,		//しっぽをふる
		98,		//でんこうせっか
		28,		//すなかけ
		313,		//うそなき
		372,		//ダメおし
		MONSNO_RIRIIN+20000,
		50,		//かなしばり
		174,		//のろい
		95,		//さいみんじゅつ
		138,		//ゆめくい
		273,		//ねがいごと
		248,		//みらいよち
		105,		//じこさいせい
		MONSNO_SUKANPUU+20000,
		228,		//おいうち
		43,		//にらみつける
		123,		//スモッグ
		38,		//すてみタックル
		242,		//かみくだく
		184,		//こわいかお
		310,		//おどろかす
		386,		//おしおき
		MONSNO_USOHATI+20000,
		120,		//じばく
		29,		//ずつき
		106,		//かたくなる
		111,		//まるくなる
		205,		//ころがる
		328,		//すなじごく
		MONSNO_MANENE+20000,
		248,		//みらいよち
		95,		//さいみんじゅつ
		102,		//ものまね
		244,		//じこあんじ
		252,		//ねこだまし
		271,		//トリック
		109,		//あやしいひかり
		358,		//めざましビンタ
		298,		//フラフラダンス
		361,		//いやしのねがい
		204,		//あまえる
		MONSNO_KORAKKII+20000,
		217,		//プレゼント
		118,		//ゆびをふる
		215,		//いやしのすず
		312,		//アロマセラピー
		164,		//みがわり
		68,		//カウンター
		270,		//てだすけ
		356,		//じゅうりょく
		387,		//とっておき
		MONSNO_PERAPPU+20000,
		227,		//アンコール
		101,		//ナイトヘッド
		97,		//こうそくいどう
		417,		//わるだくみ
		48,		//ちょうおんぱ
		MONSNO_MIKAGE+20000,
		194,		//みちづれ
		220,		//いたみわけ
		108,		//えんまく
		286,		//ふういん
		288,		//おんねん
		425,		//かげうち
		MONSNO_DORAN+20000,
		225,		//りゅうのいぶき
		200,		//げきりん
		239,		//たつまき
		184,		//こわいかお
		38,		//すてみタックル
		37,		//あばれる
		232,		//メタルクロー
		328,		//すなじごく
		34,		//のしかかり
		442,		//アイアンヘッド
		MONSNO_GONBE+20000,
		122,		//したでなめる
		204,		//あまえる
		38,		//すてみタックル
		174,		//のろい
		164,		//みがわり
		18,		//ふきとばし
		228,		//おいうち
		428,		//しねんのずつき
		MONSNO_RUKA+20000,
		238,		//クロスチョップ
		197,		//みきり
		44,		//かみつく
		170,		//こころのめ
		327,		//スカイアッパー
		136,		//とびひざげり
		97,		//こうそくいどう
		410,		//しんくうは
		242,		//かみくだく
		67,		//けたぐり
		334,		//てっぺき
		299,		//ブレイズキック
		418,		//バレットパンチ
		MONSNO_ZIMEZOU+20000,
		254,		//たくわえる
		256,		//のみこむ
		255,		//はきだす
		174,		//のろい
		303,		//なまける
		34,		//のしかかり
		328,		//すなじごく
		MONSNO_SUKOOPII+20000,
		185,		//だましうち
		103,		//いやなおと
		28,		//すなかけ
		163,		//きりさく
		109,		//あやしいひかり
		18,		//ふきとばし
		97,		//こうそくいどう
		228,		//おいうち
		400,		//つじぎり
		MONSNO_GUREGGU+20000,
		382,		//さきどり
		364,		//フェイント
		223,		//ばくれつパンチ
		29,		//ずつき
		410,		//しんくうは
		96,		//ヨガのポーズ
		252,		//ねこだまし
		358,		//めざましビンタ
		265,		//きつけ
		238,		//クロスチョップ
		418,		//バレットパンチ
		MONSNO_HAEZIGOKU+20000,
		79,		//ねむりごな
		78,		//しびれごな
		75,		//はっぱカッター
		21,		//たたきつける
		235,		//こうごうせい
		345,		//マジカルリーフ
		73,		//やどりぎのタネ
		388,		//なやみのタネ
		MONSNO_UOTTO+20000,
		186,		//てんしのキッス
		204,		//あまえる
		175,		//じたばた
		401,		//アクアテール
		150,		//はねる
		60,		//サイケこうせん
		321,		//くすぐる
		97,		//こうそくいどう
		MONSNO_TAMANTA+20000,
		239,		//たつまき
		56,		//ハイドロポンプ
		114,		//くろいきり
		21,		//たたきつける
		300,		//どろあそび
		157,		//いわなだれ
		243,		//ミラーコート
		346,		//みずあそび
		150,		//はねる
		324,		//シグナルビーム
		MONSNO_YUKIKABURI+20000,
		73,		//やどりぎのタネ
		345,		//マジカルリーフ
		402,		//タネばくだん
		74,		//せいちょう
		38,		//すてみタックル
		54,		//しろいきり
		23,		//ふみつけ
		0xffff,		//終端
};


#define KOWAZA_TABLE_MAX (1909)

