//============================================================================================
/**
 * @file	maptype.h
 * @brief	マップの種類指定
 * @date	2005.12.15
 *
 */
//============================================================================================
#ifndef	__MAPTYPE_H__
#define	__MAPTYPE_H__
//------------------------------------------------------------------
/**
 * @brief	マップの種類指定
 *
 * 注意：マップの種類指定を個別の箇所で参照することは禁止する。
 * つまり、
 *	if (maptype == MAPTYPE_FIELD) { ... }
 * というようなプログラムは書かない。
 * MAPTYPEは今後追加される可能性があるため、個別のソースでそのような
 * 参照箇所があると追加が不可能になってしまう。
 * maptype.c内にMAPTYPE_IsFieldCheck()というような関数を定義して、
 * そこで参照を行うこと。
 */
//------------------------------------------------------------------
typedef enum {
	MAPTYPE_NOWHERE = 0,		///<どこでもない。参照されないはず
	MAPTYPE_TOWN,				///<町
	MAPTYPE_ROAD,				///<道路
	MAPTYPE_CAVE,				///<洞窟（バリエーション追加される可能性あり）
	MAPTYPE_ROOM,				///<部屋（バリエーション追加される可能性あり）
	MAPTYPE_POKECEN,			///<ポケセン
	MAPTYPE_UNDERGROUND,		///<たんこう
}MAPTYPE;

#endif	//	__MAPTYPE_H__
