//=============================================================================
/**
 * @file	msgboy.h
 * @brief	メッセージ登録少年イベント処理
 * @author	taya
 * @date	2006.05.27
 */
//=============================================================================
#ifndef __MSGBOY_H__
#define __MSGBOY_H__

#include "field\field.h"

//------------------------------------------------------------------
/**
 * イベント開始
 *
 * @param   event
 *
 */
//------------------------------------------------------------------
extern void MSGBOY_EventStart( GMEVENT_CONTROL* event );

#endif
