//============================================================================================
/**
 * @file	scr_exchange.h
 * @bfief	スクリプトコマンド：景品交換所
 * @author	Tomomichi Ohta
 * @date	06.06.30
 */
//============================================================================================
#ifndef SCR_EXCHANGE_H
#define SCR_EXCHANGE_H

//============================================================================================
//
//	プログラムでのみ参照する定義
//
//============================================================================================
//__ASM_NO_DEF_が定義されている場合、アセンブラソースなので以下は無効にする
#ifndef	__ASM_NO_DEF_
extern BOOL EvCmdGetCoinGift( VM_MACHINE * core );

#endif	/* __ASM_NO_DEF_ */


#endif	/* SCR_EXCHANGE_H */

