//[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[
/**
 *
 *	@file		scr_hideneff.h
 *	@brief		ヒデン技エフェクトスクリプト管理
 *	@author		tomoya takahshi
 *	@data		2006.06.27
 *
 */
//]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]
#ifndef __SCR_HIDENEFF_H__
#define __SCR_HIDENEFF_H__

#include "fieldsys.h"

#undef GLOBAL
#ifdef	__SCR_HIDENEFF_H_GLOBAL
#define	GLOBAL	/* */
#else
#define	GLOBAL	extern
#endif

//-----------------------------------------------------------------------------
/**
 *					定数宣言
*/
//-----------------------------------------------------------------------------
//-------------------------------------
//	管理ヒデン技定数
//=====================================
enum{
	SCR_HIDENEFF_IAIGIRI,
	SCR_HIDENEFF_IWAKUDAKI,
	SCR_HIDENEFF_IWAKUDAKI_KUROGANE,
	SCR_HIDENEFF_NUM
};

//-----------------------------------------------------------------------------
/**
 *					構造体宣言
*/
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
/**
 *					プロトタイプ宣言
*/
//-----------------------------------------------------------------------------
extern void ScrCmd_HidenEffContStart( FIELDSYS_WORK* fsys, u16* p_retwk, u32 effect_type, u32 heap );

#undef	GLOBAL
#endif		// __SCR_HIDENEFF_H__

