//============================================================================================
/**
 * @file	sysflag.c
 * @bfief	プログラム、スクリプトからアクセスされるシステムフラグ操作
 * @author	Satoshi Nohara
 * @date	06.03.12
 */
//============================================================================================
#include "common.h"
#include "system/pm_rtc.h"			//GF_RTC_IsNightTime
#include "system/snd_tool.h"
#include "fieldsys.h"
#include "script.h"
#include "field/evwkdef.h"
#include "sysflag.h"
#include "contest/contest_def.h"
#include "mapdefine.h"				//ZONE_ID_C01


//============================================================================================
//
//	プロトタイプ宣言
//
//============================================================================================
static void SysFlag_Set( EVENTWORK* ev, u16 flag );
static void SysFlag_Reset( EVENTWORK* ev, u16 flag );
static BOOL SysFlag_Check( EVENTWORK* ev, u16 flag );
static BOOL SysFlag_Common( EVENTWORK* ev, SYSFLAG_MODE mode, u32 flag_id);


//============================================================================================
//
//	関数
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * システムフラグセット
 *
 * @param	ev			EVENTWORKのポインタ
 * @param	flag		フラグナンバー
 *
 * @retval	none
 *
 * システムフラグは、スクリプトのセーブフラグを使用している
 */
//--------------------------------------------------------------------------------------------
static void SysFlag_Set( EVENTWORK* ev, u16 flag )
{
	EventWork_SetEventFlag( ev, flag );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * システムフラグリセット
 *
 * @param	ev			EVENTWORKのポインタ
 * @param	flag		フラグナンバー
 *
 * @retval	none
 *
 * システムフラグは、スクリプトのセーブフラグを使用している
 */
//--------------------------------------------------------------------------------------------
static void SysFlag_Reset( EVENTWORK* ev, u16 flag )
{
	EventWork_ResetEventFlag( ev, flag );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * システムフラグチェック
 *
 * @param	ev			EVENTWORKのポインタ
 * @param	flag		フラグナンバー
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 *
 * システムフラグは、スクリプトのセーブフラグを使用している
 */
//--------------------------------------------------------------------------------------------
static BOOL SysFlag_Check( EVENTWORK* ev, u16 flag )
{
	return EventWork_CheckEventFlag( ev, flag );
}

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
static BOOL SysFlag_Common( EVENTWORK* ev, SYSFLAG_MODE mode, u32 flag_id)
{
	switch (mode) {
	case SYSFLAG_MODE_SET:
		SysFlag_Set( ev, flag_id);
		break;
	case SYSFLAG_MODE_RESET:
		SysFlag_Reset( ev, flag_id);
		break;
	case SYSFLAG_MODE_CHECK:
		return SysFlag_Check( ev, flag_id);
	default:
		GF_ASSERT_MSG(0, "FLAG %d, NOT DEFINED MODE %d\n", flag_id, mode);
	}
	return FALSE;
}

//============================================================================================
//
//	バッグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * バッグ入手フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BagSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_BAG_GET );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バッグ入手フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_BagCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_BAG_GET );
}

//============================================================================================
//
//	カンナギのギンガ団イベント関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * カンナギのギンガ団イベントフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_T05GingaEventSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_T05_GINGA_EVENT );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * カンナギのギンガ団イベントフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_T05GingaEventCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_T05_GINGA_EVENT );
}

//============================================================================================
//
//	ゲームクリア関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * ゲームクリアフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_GameClearSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_GAME_CLEAR );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * ゲームクリアフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_GameClearCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_GAME_CLEAR );
}


//============================================================================================
//
//	連れ歩きフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 連れ歩きフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PairSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_PAIR );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 連れ歩きフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PairReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_PAIR );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 連れ歩きフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_PairCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_PAIR );
}


//============================================================================================
//
//	一歩動いたかフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 一歩動いたかフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_OneStepSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_ONE_STEP );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 一歩動いたかフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_OneStepReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_ONE_STEP );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 一歩動いたかフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_OneStepCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_ONE_STEP );
}


//============================================================================================
//
//	バトルサーチャーのバッテリーを使用しているかフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャーのバッテリーを使用しているかフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BtlSearcherUseSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_BTL_SEARCHER_USE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャーのバッテリーを使用しているかフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BtlSearcherUseReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_BTL_SEARCHER_USE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャーのバッテリーを使用しているかフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_BtlSearcherUseCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_BTL_SEARCHER_USE );
}



//============================================================================================
//
//	地下フラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 地下：到着フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgArriveSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_ARRIVE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：到着フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgArriveReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_ARRIVE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：到着フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgArriveCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_ARRIVE );
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：化石フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgDigSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_DIG );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：化石フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgDigReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_DIG );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：化石フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgDigCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_DIG );
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：玉フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgTamaSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_TAMA );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：玉フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgTamaReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_TAMA );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：玉フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgTamaCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_TAMA );
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：基地フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgBaseSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_BASE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：基地フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgBaseReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_BASE );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：基地フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgBaseCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_BASE );
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：模様替えフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgGoodsSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_GOODS );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：模様替えフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgGoodsReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_GOODS );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：模様替えフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgGoodsCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_GOODS );
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：旗フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgHataSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_HATA );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：旗フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgHataReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_HATA );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下：旗フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgHataCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_HATA );
}


//============================================================================================
//
//	コンテスト マスターランククリアフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * コンテスト マスターランククリア フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	type	コンテストタイプ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ConMasterSet( EVENTWORK* ev, int type )
{
	switch( type ){

	///コンテストタイプ：格好よさ
	case  CONTYPE_STYLE:
		SysFlag_Set( ev, SYS_FLAG_CON_STYLE_MASTER );
		break;

	///コンテストタイプ：美しさ
	case CONTYPE_BEAUTIFUL:
		SysFlag_Set( ev, SYS_FLAG_CON_BEAUTIFUL_MASTER );
		break;

	///コンテストタイプ：可愛さ
	case CONTYPE_CUTE:
		SysFlag_Set( ev, SYS_FLAG_CON_CUTE_MASTER );
		break;

	///コンテストタイプ：賢さ
	case CONTYPE_CLEVER:
		SysFlag_Set( ev, SYS_FLAG_CON_CLEVER_MASTER );
		break;

	///コンテストタイプ：逞しさ
	case CONTYPE_STRONG:
		SysFlag_Set( ev, SYS_FLAG_CON_STRONG_MASTER );
		break;
	};

	return;
}

//--------------------------------------------------------------------------------------------
/**
 * コンテスト マスターランククリア フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	type	コンテストタイプ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ConMasterReset( EVENTWORK* ev, int type )
{
	switch( type ){

	///コンテストタイプ：格好よさ
	case  CONTYPE_STYLE:
		SysFlag_Reset( ev, SYS_FLAG_CON_STYLE_MASTER );
		break;

	///コンテストタイプ：美しさ
	case CONTYPE_BEAUTIFUL:
		SysFlag_Reset( ev, SYS_FLAG_CON_BEAUTIFUL_MASTER );
		break;

	///コンテストタイプ：可愛さ
	case CONTYPE_CUTE:
		SysFlag_Reset( ev, SYS_FLAG_CON_CUTE_MASTER );
		break;

	///コンテストタイプ：賢さ
	case CONTYPE_CLEVER:
		SysFlag_Reset( ev, SYS_FLAG_CON_CLEVER_MASTER );
		break;

	///コンテストタイプ：逞しさ
	case CONTYPE_STRONG:
		SysFlag_Reset( ev, SYS_FLAG_CON_STRONG_MASTER );
		break;
	};

	return;
}

//--------------------------------------------------------------------------------------------
/**
 * コンテスト マスターランククリア フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	type	コンテストタイプ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_ConMasterCheck( EVENTWORK* ev, int type )
{
	int ret;

	switch( type ){

	///コンテストタイプ：格好よさ
	case  CONTYPE_STYLE:
		ret = SysFlag_Check( ev, SYS_FLAG_CON_STYLE_MASTER );
		break;

	///コンテストタイプ：美しさ
	case CONTYPE_BEAUTIFUL:
		ret = SysFlag_Check( ev, SYS_FLAG_CON_BEAUTIFUL_MASTER );
		break;

	///コンテストタイプ：可愛さ
	case CONTYPE_CUTE:
		ret = SysFlag_Check( ev, SYS_FLAG_CON_CUTE_MASTER );
		break;

	///コンテストタイプ：賢さ
	case CONTYPE_CLEVER:
		ret = SysFlag_Check( ev, SYS_FLAG_CON_CLEVER_MASTER );
		break;

	///コンテストタイプ：逞しさ
	case CONTYPE_STRONG:
		ret = SysFlag_Check( ev, SYS_FLAG_CON_STRONG_MASTER );
		break;
	};

	return ret;
}


//============================================================================================
//
//	バトルサーチャー：フラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャー フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	lv		レベル
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BsLvSet( EVENTWORK* ev, int lv )
{
	switch( lv ){

	case  1:
		SysFlag_Set( ev, SYS_FLAG_BS_LV1 );
		break;

	case 2:
		SysFlag_Set( ev, SYS_FLAG_BS_LV2 );
		break;

	case 3:
		SysFlag_Set( ev, SYS_FLAG_BS_LV3 );
		break;

	case 4:
		SysFlag_Set( ev, SYS_FLAG_BS_LV4 );
		break;

	case 5:
		SysFlag_Set( ev, SYS_FLAG_BS_LV5 );
		break;
	};

	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャー フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	lv		レベル
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BsLvReset( EVENTWORK* ev, int lv )
{
	switch( lv ){

	case  1:
		SysFlag_Reset( ev, SYS_FLAG_BS_LV1 );
		break;

	case 2:
		SysFlag_Reset( ev, SYS_FLAG_BS_LV2 );
		break;

	case 3:
		SysFlag_Reset( ev, SYS_FLAG_BS_LV3 );
		break;

	case 4:
		SysFlag_Reset( ev, SYS_FLAG_BS_LV4 );
		break;

	case 5:
		SysFlag_Reset( ev, SYS_FLAG_BS_LV5 );
		break;
	};

	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルサーチャー フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	lv		レベル
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_BsLvCheck( EVENTWORK* ev, int lv )
{
	int ret = FALSE;

	switch( lv ){

	case  1:
		ret = SysFlag_Check( ev, SYS_FLAG_BS_LV1 );
		break;

	case 2:
		ret = SysFlag_Check( ev, SYS_FLAG_BS_LV2 );
		break;

	case 3:
		ret = SysFlag_Check( ev, SYS_FLAG_BS_LV3 );
		break;

	case 4:
		ret = SysFlag_Check( ev, SYS_FLAG_BS_LV4 );
		break;

	case 5:
		ret = SysFlag_Check( ev, SYS_FLAG_BS_LV5 );
		break;
	};

	return ret;
}


//============================================================================================
//
//	イベントBGM切り替え：フラグ関連
//
//	フラグ操作とは意味合いが違うのでここのソースに入れるのは微妙。。。
//
//	フラグ定義はこのソースだけで参照したい、
//	case分は２箇所に書きたくない、
//	昼夜指定がある、
//
//	テーブル作って、ゾーン、フラグ、BGM昼、BGM夜を作るいいかも。
//	テーブル置く場所は、ここになる？(フラグはこのソースだけで参照したいので)
//	。。。とりあえず保留。
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * イベントBGM切り替え フラグのチェックをして、切り替えるBGMナンバーを取得
 *
 * @param	ev		EVENTWORKのポインタ
 * @param	zone_id ゾーンID
 *
 * @retval	"0		= フラグオフなので何もなし"
 * @retval	"0以外	= 変更するBGMナンバー"
 */
//--------------------------------------------------------------------------------------------
u16 SysFlag_EventBgmGet( EVENTWORK* ev, int zone_id )
{
	u16 bgm = 0;

	switch( zone_id ){

	//リッシ湖
	case  ZONE_ID_D28R0101:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D28) == 1 ){
			bgm = SEQ_D_LAKE;
		}
		break;

	case  ZONE_ID_D28R0103:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D28) == 1 ){
			bgm = SEQ_D_RYAYHY;
		}
		break;

	//d27
	case  ZONE_ID_D27R0102:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D27) == 1 ){
			bgm = SEQ_D_LAKE;
		}
		break;

	//d29
	case  ZONE_ID_D29R0102:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D29) == 1 ){
			bgm = SEQ_D_LAKE;
		}
		break;

	//d10r0101
	case  ZONE_ID_D10R0101:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D10) == 1 ){
			bgm = SEQ_D_SAFARI;
		}
		break;

	//t02
	case  ZONE_ID_T02R0101:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_T02) == 1 ){
			bgm = SEQ_OPENING2;
		}
		break;
#if 0
	//c02
	case  ZONE_ID_C02R0101:
	case  ZONE_ID_C02R0102:
	case  ZONE_ID_C02R0103:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_C02) == 1 ){
			bgm = SEQ_THE_EVENT01;
		}
		break;
#endif

	//ギンガ団アジト
	//ギンガ団崩壊
	case  ZONE_ID_D26R0101:
	case  ZONE_ID_D26R0102:
	case  ZONE_ID_D26R0103:
	case  ZONE_ID_D26R0104:
	case  ZONE_ID_D26R0105:
	case  ZONE_ID_D26R0106:
	case  ZONE_ID_D26R0107:
	case  ZONE_ID_D26R0108:

		//ギンガ団崩壊していたら
		if( SysFlag_Check(ev,SYS_FLAG_BGM_GINGA) == 1 ){

			if( GF_RTC_IsNightTime() == FALSE ){			//FALSE=昼、TRUE=夜
				bgm = SEQ_CITY07_D;
			}else{
				bgm = SEQ_CITY07_N;
			}
			break;	//必要！
		}

		//ギンガ団アジト侵入マップの時
		if( zone_id == ZONE_ID_D26R0101 ){
			if( SysFlag_Check(ev,SYS_FLAG_BGM_D26) == 1 ){
				bgm = SEQ_D_AGITO;
			}
		}
		break;

	//ギンガ団支部
	case  ZONE_ID_C04R0201:
	case  ZONE_ID_C04R0202:
	case  ZONE_ID_C04R0203:
	case  ZONE_ID_C04R0204:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_C04) == 1 ){
			if( GF_RTC_IsNightTime() == FALSE ){			//FALSE=昼、TRUE=夜
				bgm = SEQ_CITY04_D;
			}else{
				bgm = SEQ_CITY04_N;
			}
		}
		break;

	//発電所
	case  ZONE_ID_D02R0101:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D02) == 1 ){
			if( GF_RTC_IsNightTime() == FALSE ){			//FALSE=昼、TRUE=夜
				bgm = SEQ_ROAD_C_D;
			}else{
				bgm = SEQ_ROAD_C_N;
			}
		}
		break;

	//ソノオの花畑
	case  ZONE_ID_D13R0101:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_D13) == 1 ){
			if( GF_RTC_IsNightTime() == FALSE ){			//FALSE=昼、TRUE=夜
				bgm = SEQ_TOWN03_D;
			}else{
				bgm = SEQ_TOWN03_N;
			}
		}
		break;

	//R224配布イベント
	case  ZONE_ID_R224:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_R224) == 1 ){
			if( GF_RTC_IsNightTime() == FALSE ){			//FALSE=昼、TRUE=夜
				bgm = SEQ_TOWN03_D;
			}else{
				bgm = SEQ_TOWN03_N;
			}
		}
		break;

	//チャンピオンの部屋
	case  ZONE_ID_C10R0111:
		if( SysFlag_Check(ev,SYS_FLAG_BGM_C10) == 1 ){
			bgm = SEQ_SILENCE_FIELD;
		}
		break;

	};


	return bgm;
}


//============================================================================================
//
//	通信カウンター通過フラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 通信カウンター通過フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_CommCounterSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_COMM_COUNTER );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 通信カウンター通過フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_CommCounterReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_COMM_COUNTER );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 通信カウンター通過フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_CommCounterCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_COMM_COUNTER );
}

//============================================================================================
//
//	ポケモンステータス：コンテスト技フラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * ポケモンステータス：コンテスト技フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PSTContestSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_PST );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * ポケモンステータス：コンテスト技フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PSTContestReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_PST );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * ポケモンステータス：コンテスト技フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_PSTContestCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_PST );
}


//============================================================================================
//
//	地下初回イベントフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 地下初回イベントフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgFirstSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_UG_FIRST );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下初回イベントフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_UgFirstReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_UG_FIRST );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 地下初回イベントフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_UgFirstCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_UG_FIRST );
}


//============================================================================================
//
//	GTCオープンフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * GTCオープンフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_GTCOpenSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_GTC_OPEN );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * GTCオープンフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_GTCOpenReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_GTC_OPEN );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * GTCオープンフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_GTCOpenCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_GTC_OPEN );
}


//============================================================================================
//
//	バトルタワーオープンフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * バトルタワーオープンフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BTowerOpenSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_BTOWER_OPEN );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルタワーオープンフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_BTowerOpenReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_BTOWER_OPEN );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * バトルタワーオープンフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_BTowerOpenCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_BTOWER_OPEN );
}


//============================================================================================
//
//	船が使えるフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 船が使えるフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ShipSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_SHIP );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 船が使えるフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ShipReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_SHIP );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * 船が使えるフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_ShipCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_SHIP );
}


//============================================================================================
//
//	レイアイハイ救出フラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * レイアイハイ救出フラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ReiAiHaiSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_REIAIHAI );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * レイアイハイ救出フラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_ReiAiHaiReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_REIAIHAI );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * レイアイハイ救出フラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_ReiAiHaiCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_REIAIHAI );
}


//============================================================================================
//
//	ミズキフラグ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * ミズキフラグのセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_MizukiSet( EVENTWORK* ev )
{
	SysFlag_Set( ev, SYS_FLAG_MIZUKI );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * ミズキフラグのリセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_MizukiReset( EVENTWORK* ev )
{
	SysFlag_Reset( ev, SYS_FLAG_MIZUKI );
	return;
}

//--------------------------------------------------------------------------------------------
/**
 * ミズキフラグのチェック
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	"1 = フラグON"
 * @retval	"0 = フラグOFF"
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_MizukiCheck( EVENTWORK* ev )
{
	return SysFlag_Check( ev, SYS_FLAG_MIZUKI );
}


//============================================================================================
//
//	ポケッチ抑止関連
//
//============================================================================================
//--------------------------------------------------------------------------------------------
///	システムフラグセット：ポケッチ抑止
//--------------------------------------------------------------------------------------------
void SysFlag_PoketchHookSet(EVENTWORK * ev)
{
	SysFlag_Set(ev, SYS_FLAG_POKETCH_HOOK);
}
//--------------------------------------------------------------------------------------------
///	システムフラグリセット：ポケッチ抑止
//--------------------------------------------------------------------------------------------
void SysFlag_PoketchHookReset(EVENTWORK * ev)
{
	SysFlag_Reset(ev, SYS_FLAG_POKETCH_HOOK);
}
//--------------------------------------------------------------------------------------------
///	システムフラグ取得：ポケッチ抑止
//--------------------------------------------------------------------------------------------
BOOL SysFlag_PoketchHookCheck(EVENTWORK * ev)
{
	return SysFlag_Check(ev, SYS_FLAG_POKETCH_HOOK);
}

//============================================================================================
//		サファリモード関連
//============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * @brief	サファリモードフラグのセット
 * @param	ev		EVENTWORKのポインタ
 */
//--------------------------------------------------------------------------------------------
void SysFlag_SafariSet(EVENTWORK * ev)
{
	SysFlag_Set(ev, SYS_FLAG_SAFARI_MODE);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	サファリモードフラグのリセット
 * @param	ev		EVENTWORKのポインタ
 */
//--------------------------------------------------------------------------------------------
void SysFlag_SafariReset(EVENTWORK * ev)
{
	SysFlag_Reset(ev, SYS_FLAG_SAFARI_MODE);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	サファリモードフラグのセット
 * @param	ev		EVENTWORKのポインタ
 * @return	BOOL	フラグの値
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_SafariCheck(EVENTWORK * ev)
{
	return SysFlag_Check(ev, SYS_FLAG_SAFARI_MODE);
}

//============================================================================================
//		ポケパークモード関連
//============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * @brief	ポケパークモードフラグのセット
 * @param	ev		EVENTWORKのポインタ
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PokeParkSet(EVENTWORK * ev)
{
	SysFlag_Set(ev, SYS_FLAG_POKEPARK_MODE);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	ポケパークモードフラグのリセット
 * @param	ev		EVENTWORKのポインタ
 */
//--------------------------------------------------------------------------------------------
void SysFlag_PokeParkReset(EVENTWORK * ev)
{
	SysFlag_Reset(ev, SYS_FLAG_POKEPARK_MODE);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	ポケパークモードフラグのセット
 * @param	ev		EVENTWORKのポインタ
 * @return	BOOL	フラグの値
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_PokeParkCheck(EVENTWORK * ev)
{
	return SysFlag_Check(ev, SYS_FLAG_POKEPARK_MODE);
}

//============================================================================================
//
//		サイクリングロード関連
//
//============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * @brief	サイクリングロードモードフラグのセット
 * @param	ev		EVENTWORKのポインタ
 * @return	BOOL	フラグの値
 */
//--------------------------------------------------------------------------------------------
void SysFlag_CyclingRoadSet(EVENTWORK * ev)
{
	SysFlag_Set(ev, SYS_FLAG_CYCLINGROAD);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	サイクリングロードモードフラグのリセット
 * @param	ev		EVENTWORKのポインタ
 * @return	BOOL	フラグの値
 */
//--------------------------------------------------------------------------------------------
void SysFlag_CyclingRoadReset(EVENTWORK * ev)
{
	SysFlag_Reset(ev, SYS_FLAG_CYCLINGROAD);
}
//--------------------------------------------------------------------------------------------
/**
 * @brief	サイクリングロードモードフラグのチェック
 * @param	ev		EVENTWORKのポインタ
 * @return	BOOL	フラグの値
 */
//--------------------------------------------------------------------------------------------
BOOL SysFlag_CyclingRoadCheck(EVENTWORK * ev)
{
	return SysFlag_Check(ev, SYS_FLAG_CYCLINGROAD);
}

//============================================================================================
//
//	ひでんわざ関連
//
//============================================================================================
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
BOOL SysFlag_Kairiki( EVENTWORK* ev, SYSFLAG_MODE mode)
{
	return SysFlag_Common( ev, mode, SYS_FLAG_KAIRIKI );
}

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
void SysFlag_FlashSet(EVENTWORK* ev)
{
	SysFlag_Set(ev, SYS_FLAG_FLASH);
}
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
void SysFlag_FlashReset(EVENTWORK* ev)
{
	SysFlag_Reset(ev, SYS_FLAG_FLASH);
}
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
BOOL SysFlag_FlashCheck(EVENTWORK* ev)
{
	return SysFlag_Check(ev, SYS_FLAG_FLASH);
}

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
void SysFlag_KiribaraiSet(EVENTWORK* ev)
{
	SysFlag_Set(ev, SYS_FLAG_KIRIBARAI);
}
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
void SysFlag_KiribaraiReset(EVENTWORK* ev)
{
	SysFlag_Reset(ev, SYS_FLAG_KIRIBARAI);
}
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
BOOL SysFlag_KiribaraiCheck(EVENTWORK* ev)
{
	return SysFlag_Check(ev, SYS_FLAG_KIRIBARAI);
}

//============================================================================================
//		冒険ノート関連
//============================================================================================
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
BOOL SysFlag_FNote( EVENTWORK* ev, SYSFLAG_MODE mode )
{
	return SysFlag_Common( ev, mode, SYS_FLAG_FNOTE_GET );
}

//============================================================================================
//
//		到着フラグ関連
//
//============================================================================================
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
BOOL SysFlag_Arrive( EVENTWORK* ev, SYSFLAG_MODE mode, u32 arrive_id )
{
	GF_ASSERT( arrive_id < FLAG_ARRIVE_MAX );
	return SysFlag_Common( ev, mode, SYS_FLAG_ARRIVE_START + arrive_id );
}

//============================================================================================
//
//		イベント関連
//
//============================================================================================
//--------------------------------------------------------------------------------------------
/**
 * WiFiに繋いだ
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @retval	none
 */
//--------------------------------------------------------------------------------------------
void SysFlag_WifiUseSet( EVENTWORK* ev )
{
	SysFlag_Set(ev, SYS_FLAG_WIFI_USE);
}

//============================================================================================
//
//		デバッグ機能関連
//
//============================================================================================
#ifdef PM_DEBUG

//システムフラグ系をゲットする
u32 DNumInput_SysFlagGet(SAVEDATA* sv,u32 param)
{
	EVENTWORK* ev = SaveData_GetEventWork(sv);
	return SysFlag_Check( ev,param);
}
//システムフラグ系をセットする
void DNumInput_SysFlagSet(SAVEDATA* sv,u32 param,u32 value)
{
	EVENTWORK* ev = SaveData_GetEventWork(sv);
	if(value){
		SysFlag_Set(ev,param);
	}else{
		SysFlag_Reset(ev,param);
	}
}

#endif	//PM_DEBUG

