//============================================================================================
/**
 * @file	syswork.h
 * @bfief	プログラム、スクリプトからアクセスされるシステムワーク操作
 * @author	Satoshi Nohara
 * @date	05.11.01
 */
//============================================================================================
#ifndef	__SYSWORK_H__
#define	__SYSWORK_H__


#include "field/eventflag.h"


//============================================================================================
//	ワーク定義
//
//	SysWork_...Set
//	SysWork_...Get
//	関数を作り、そこからアクセスするようにする
//
//============================================================================================
#include "syswork_def.h"


//============================================================================================
//
//	連れ歩きトレーナーID格納ワーク関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 連れ歩きトレーナーID格納ワークセット
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	no			トレーナーID
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_PairTrainerIDSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * 連れ歩きトレーナーID格納ワークゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"トレーナーID"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_PairTrainerIDGet( EVENTWORK* ev );


//============================================================================================
//
//	最初のポケモンナンバー関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * 最初のポケモンナンバーセット
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	no			ポケモンナンバー
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_FirstPokeNoSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * 最初のポケモンナンバーゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"最初のポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_FirstPokeNoGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * ライバルのポケモンナンバーゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"ライバルのポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_RivalPokeNoGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * サポートのポケモンナンバーゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"サポートのポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_SupportPokeNoGet( EVENTWORK* ev );


//============================================================================================
//
//	コンテスト関連(後で対応を考える。。。)
//
//	コンテストは、受付マップから、オープニング会場マップへ切り替わるので、
//	スクリプトを終了すると、コンテストシステムのポインタが保持できないので、
//	セーブワークに保存している(暫定)
//
//============================================================================================

#if 0	//使用不可！
//--------------------------------------------------------------------------------------------
/**
 * コンテストシステムワークへのポインタセット
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	pwork		コンテストシステムワークへのポインタ
 *
 * @return	"TRUE"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_ContestAdrsSet( EVENTWORK* ev, void* pwork );

//--------------------------------------------------------------------------------------------
/**
 * コンテストシステムワークへのポインタ取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"最初のポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern void* SysWork_ContestAdrsGet( EVENTWORK* ev );
#endif


//--------------------------------------------------------------------------------------------
/**
 * 現在の記録を取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"個体値"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_OokisaRecordGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 記録を書き換える
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	no			個体値
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_OokisaRecordSet( EVENTWORK* ev, u16 no );


//============================================================================================
//
//	バトルサーチャー関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * マップ遷移した時のリセット処理
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void Sys_BtlSearcherReset( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * バッテリーカウントを取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_BtlSearcherBatteryGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * バッテリーカウントをセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_BtlSearcherBatterySet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * クリアカウントを取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_BtlSearcherClearGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * クリアカウントをセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_BtlSearcherClearSet( EVENTWORK* ev, u16 no );


//============================================================================================
//
//			配布イベント関連
//
//============================================================================================


//------------------------------------------------------------------
/**
 * @brief	配布イベント：許可状態のセット
 * @param	ev			EVENTWORKへのポインタ
 * @param	haihu_id	配布イベントのID
 */
//------------------------------------------------------------------
extern void SysWork_HaihuEventWorkSet(EVENTWORK * ev, int haihu_id);

//------------------------------------------------------------------
/**
 * @brief	配布イベント：許可状態のクリア
 * @param	ev			EVENTWORKへのポインタ
 * @param	haihu_id	配布イベントのID
 */
//------------------------------------------------------------------
extern void SysWork_HaihuEventWorkClear(EVENTWORK * ev, int haihu_id);

//------------------------------------------------------------------
/**
 * @brief	配布イベント：許可状態の取得
 * @param	ev			EVENTWORKへのポインタ
 * @param	haihu_id	配布イベントのID
 * @return	BOOL		配布イベント許可のとき、TRUE
 */
//------------------------------------------------------------------
extern BOOL SysWork_HaihuEventWorkCheck(EVENTWORK * ev, int haihu_id);

//============================================================================================
//
//			隠しマップ関連
//
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * @brief	隠しマップ：出現状態にする
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	hidemap_id	隠しマップのID（HIDEMAP_ID_～、直値では０から３）
 */
//--------------------------------------------------------------------------------------------
extern void SysWork_HideMapWorkSet(EVENTWORK * ev, int hidemap_id);

//--------------------------------------------------------------------------------------------
/**
 * @brief	隠しマップ：隠蔽状態にする
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	hidemap_id	隠しマップのID（HIDEMAP_ID_～、直値では０から３）
 */
//--------------------------------------------------------------------------------------------
extern void SysWork_HideMapWorkClear(EVENTWORK * ev, int hidemap_id);

//--------------------------------------------------------------------------------------------
/**
 * @brief	隠しマップ：出現状態をチェック
 *
 * @param	ev			EVENTWORKへのポインタ
 * @param	hidemap_id	隠しマップのID（HIDEMAP_ID_～、直値では０から３）
 *
 * @retval	TRUE		出現している
 * @retval	FALSE		隠れている
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_HideMapWorkCheck(EVENTWORK * ev, int hidemap_id);

//--------------------------------------------------------------------------------------------
/**
 * 自然公園の総歩数クリア
 *
 * @param	ev			EVENTWORKへのポインタ
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_ParkWalkCountClear( EVENTWORK* ev);

//--------------------------------------------------------------------------------------------
/**
 * 自然公園の総歩数ゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"最初のポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_ParkWalkCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 自然公園の総歩数を＋１
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"最初のポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_ParkWalkCountPlus( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 新聞社締め切りカウンタを取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_NewsDaysCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 新聞社締め切りカウンタをセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_NewsDaysCountSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * 地下会話カウントを取得(ミカゲ専用)
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_UGTalkCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 地下会話カウントをセット(ミカゲ専用)
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_UGTalkCountSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * 地下会話カウントを取得
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_UGTalkCount2Get( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * 地下会話カウントをセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_UGTalkCount2Set( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
//			ポケモンクジ関連
//--------------------------------------------------------------------------------------------

//--------------------------------------------------------------------------------------------
/**
 * ポケモンクジ乱数に値をセット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void SysWork_pokelot_value_set( EVENTWORK* ev ,u32 val);

//--------------------------------------------------------------------------------------------
/**
 * ポケモンクジ乱数の値をゲット
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern u32 SysWork_pokelot_value_get(EVENTWORK* ev);

//--------------------------------------------------------------------------------------------
/**
 * ポケモンクジ乱数の値を初期化
 *  ゲーム開始時の初期化処理
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void SysWorkInitPokeLot(EVENTWORK* ev);

//--------------------------------------------------------------------------------------------
/**
 * ポケモンクジ乱数の値を初期化
 * 日数経過による更新処理
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void SysWorkUpdatePokeLot(SAVEDATA *sv,u16 days);

//--------------------------------------------------------------------------------------------
/**
 * レンチャン数をゲット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	カウント
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_RensyouCountGet( EVENTWORK* ev);

//--------------------------------------------------------------------------------------------
/**
 * レンチャン数をセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_RensyouCountSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 * １日１回、ポケモンのレベルと同じ数のとき、アイテムをくれるおじさん
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_PokeLevelNoGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 * １日１回、ポケモンのレベルと同じ数のとき、アイテムをくれるおじさん
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_PokeLevelNoSet( EVENTWORK* ev ,u16 no);

//--------------------------------------------------------------------------------------------
/**
 * １日１回、ポケモンのレベルと同じ数のとき、アイテムをくれるおじさん
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
extern void SysWorkUpdatePokeLevelNo(SAVEDATA *sv);

//--------------------------------------------------------------------------------------------
/**
 *	デパート購入回数
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"最初のポケモンナンバー"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_RegularCountPlus( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 *	デパート購入回数
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_RegularCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 *	地下で道具をあげた人数の累計
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_UGToolGiveCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 *	地下で道具をあげた人数をセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_UGToolGiveCountSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 *	地下でかせきを掘った回数の累計
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_UGKasekiDigCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 *	地下でかせきを掘った回数をセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_UGKasekiDigCountSet( EVENTWORK* ev, u16 no );

//--------------------------------------------------------------------------------------------
/**
 *	地下でトラップにかけた回数の累計
 *
 * @param	ev		EVENTWORKのポインタ
 *
 * @return	"カウント"
 */
//--------------------------------------------------------------------------------------------
extern u16 SysWork_UGTrapHitCountGet( EVENTWORK* ev );

//--------------------------------------------------------------------------------------------
/**
 *	地下でトラップにかけた回数をセット
 *
 * @param	ev		EVENTWORKへのポインタ
 * @param	no		セットカウント
 *
 * @return	"TRUE=セット出来た、FALSE=セット出来なかった"
 */
//--------------------------------------------------------------------------------------------
extern BOOL SysWork_UGTrapHitCountSet( EVENTWORK* ev, u16 no );


//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
extern u16 SysWork_FriendlyStepCountGet(EVENTWORK * ev);
extern void SysWork_FriendlyStepCountSet(EVENTWORK * ev, u16 step);

#endif	//__SYSWORK_H__
