//==============================================================================
/**
 * @file	we_039.s
 * @brief	ÇµÇ¡Ç€ÇÇ”ÇÈ			39
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_SIPPOWOHURU
	
// =============================================================================
//
//
//	Å°ÇµÇ¡Ç€ÇÇ”ÇÈ			39
//
//
// =============================================================================
WEST_SIPPOWOHURU:

	LOOP_LABEL		2
	
		SE_L			SEQ_SE_DP_112

		FUNC_CALL		WEST_SP_WE_KAITEN, 3, WE_TOOL_M1, 1, 12
		WAIT_FLAG
		//SE_L			SEQ_SE_DP_112
	
	LOOP
	
	SEQEND
