//==============================================================================
/**
 * @file	we_160.s
 * @brief	テクスチャー			160
 * @author	goto
 * @date	2005.07.13(水)
 *
 * ここに色々な解説等を書いてもよい
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_TEKUSUTYAA
	
// =============================================================================
//
//
//	■テクスチャー			160
//
//
// =============================================================================
WEST_TEKUSUTYAA:
	
	LOAD_PARTICLE_DROP	0,W_160_SPA
	ADD_PARTICLE 	0,W_160_160_TEX_DUST, EMTFUNC_ATTACK_POS

	SE_REPEAT_L		SEQ_SE_DP_W112,2,4

	SE_WAITPLAY_L	SEQ_SE_DP_351,42

	WAIT_PARTICLE
	EXIT_PARTICLE	0,
	
	SEQEND
