//==============================================================================
/**
 * @file	we_114.s
 * @brief	Ç≠ÇÎÇ¢Ç´ÇË			114
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_KUROIKIRI
	
// =============================================================================
//
//
//	Å°Ç≠ÇÎÇ¢Ç´ÇË			114
//
//
// =============================================================================
WEST_KUROIKIRI:
	
	LOAD_PARTICLE_DROP	0,W_114_SPA
	ADD_PARTICLE 	0,W_114_114_KUROKIRI_MIST1, EMTFUNC_DUMMY

	SE_C			SEQ_SE_DP_W114

	WAIT_PARTICLE
	EXIT_PARTICLE	0,
	
	SEQEND
