//==============================================================================
/**
 * @file	we_290.s
 * @brief	Ç–Ç›Ç¬ÇÃÇøÇ©ÇÁ			290
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_HIMITUNOTIKARA
	
// =============================================================================
//
//
//	Å°Ç–Ç›Ç¬ÇÃÇøÇ©ÇÁ			290
//
//
// =============================================================================
WEST_HIMITUNOTIKARA:
	
	LOAD_PARTICLE_DROP	0,W_HIT_01_SPA
	ADD_PARTICLE 	0,W_HIT_01_B_BURN_RED, EMTFUNC_DEFENCE_POS

	SE_R			SEQ_SE_DP_BASI

	WAIT_PARTICLE
	EXIT_PARTICLE	0,
	
	SEQEND
