//==============================================================================
/**
 * @file	we_001.s
 * @brief	ÇÕÇΩÇ≠
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_Hataku
	
// =============================================================================
//
//
//	Å°ÇÕÇΩÇ≠
//
//
// =============================================================================
WEST_Hataku:
	
	FUNC_CALL	WEST_SP_TEST_1, 0, 0
	FUNC_CALL	WEST_SP_TEST_2, 0, 0
	FUNC_CALL	WEST_SP_TEST_3, 0, 0
	FUNC_CALL	WEST_SP_TEST_4, 0, 0
	
	SE			WAZA_EFF_SE1
	
	WAIT		60
	
	SEQEND

