//==============================================================================
/**
 * @file	wesub_006.s
 * @brief	Ç±ÇÒÇÁÇÒ
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_StatusKonran
	
// =============================================================================
//
//
//	Å°Ç±ÇÒÇÁÇÒ
//
//
// =============================================================================
WEST_ItemTR:

	LOAD_PARTICLE_DROP	0, SPA_ITEM_EFF
	
	SE_L			SEQ_SE_DP_BT_001

	ADD_PARTICLE 	0, ITEM_EFF_ITEM_TRANER, EMTFUNC_ATTACK_POS
	
	WAIT_PARTICLE
	EXIT_PARTICLE	0,

	SEQEND
