//==============================================================================
/**
 * @file	wesub_006.s
 * @brief	Ç±ÇÒÇÁÇÒ
 * @author	goto
 * @date	2005.07.13(êÖ)
 *
 * Ç±Ç±Ç…êFÅXÇ»âê‡ìôÇèëÇ¢ÇƒÇ‡ÇÊÇ¢
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_DispIn
	
// =============================================================================
//
//
//	Å°Ç›Ç™ÇÌÇËâÊñ ì‡Ç÷
//
//
// =============================================================================
WEST_DispIn:

	FUNC_CALL	WEST_SP_DISP_MOVE, 5, 1, WE_TOOL_M1, 10, 0, 0,
	
	SE_L		SEQ_SE_DP_W104
	WAIT		1
	
	FUNC_CALL	WEST_SP_WE_SSP_POKE_VANISH, 2, WE_TOOL_M1, 0

	WAIT_FLAG


	SEQEND
