//==============================================================================
/**
 * @file	wpcb_common.h
 * @brief	簡単な説明を書く
 * @author	goto
 * @date	2006.02.12(日)
 *
 * ここに色々な解説等を書いてもよい
 *
 */
//==============================================================================
#ifndef __WPCB_COMMON_H__
#define __WPCB_COMMON_H__

//--------------------------------------------------------------
/**
 *
 * @brief	wpcb_xxx.c が include するべきヘッダー群
 *
 */
//--------------------------------------------------------------
#include "wpcb_struct.h"
#include "wpcb_def.h"
#include "wpcb.h"

// -----------------------------------------
//
//	□デバッグ定義 [ 宣言時に有効 ]
//
// -----------------------------------------
#ifdef PM_DEBUG

#define WPCB_FLD_POS_MESSAGE		///< フィールドと座標を表示する

#define WPCB_AXIS_POS_MSG			///< 軸方向位置の表示
#define WPCB_AXIS_CLIENT_TYPE_MSG	///< クライアントタイプ表示

#define WPCB_NONE_DATA_MSG			///< 未実装メッセージ

#endif

#endif

