//============================================================================================
/**
 * @brief	contest_savedata.h
 * @brief	コイン操作
 * @date	2006.03.09
 * @author	tamada
 */
//============================================================================================

#ifndef	__CONTEST_SAVEDATA_H__
#define	__CONTEST_SAVEDATA_H__

//============================================================================================
//============================================================================================
//---------------------------------------------------------------------------
/**
 * @brief	コンテストデータの不完全型定義
 */
//---------------------------------------------------------------------------
typedef struct _CONTEST_DATA CONTEST_DATA;


//==============================================================================
//	外部関数宣言
//==============================================================================
extern int	CONDATA_GetWorkSize(void);
extern void CONDATA_Init(CONTEST_DATA * condata);
extern void CONDATA_RecordAdd(SAVEDATA *sv, int type, int ranking);
extern u16 CONDATA_GetValue(SAVEDATA *sv, int type, int ranking);


#endif	__CONTEST_SAVEDATA_H__
