//============================================================================================
/**
 * @file	misc.h
 * @brief	未分類セーブデータを扱うためのヘッダ
 * @author	tamada
 * @date	2006.06.02
 *
 * 分類されていないセーブデータはとりあえずここに追加される。
 *
 * セーブデータとしての性質がきちんと定義できるようになった時点で、
 * それらのセーブ構造体はきちんと別ソースに切り分けられることになる。
 *
 * 2006.06.02
 * 時間切れで分類がわからんものはここに追加することにしました。
 */
//============================================================================================
#ifndef	__MISC_H__
#define	__MISC_H__

#include "gflib/msg_print.h"

//============================================================================================
//============================================================================================
//----------------------------------------------------------
/**
 * @brief	自分状態データ型定義
 */
//----------------------------------------------------------
typedef struct _MISC MISC;

//============================================================================================
//============================================================================================
//----------------------------------------------------------
//----------------------------------------------------------
extern MISC * SaveData_GetMisc(SAVEDATA * sv);
extern const MISC * SaveData_GetMiscReadOnly(const SAVEDATA * sv);

//----------------------------------------------------------
//----------------------------------------------------------
extern const STRCODE * MISC_GetRivalName(const MISC * misc);
extern void MISC_SetRivalName(MISC * misc, STRBUF * str);

extern const STRCODE * MISC_GetMonumentName(const MISC * misc);
extern void MISC_SetMonumentName(MISC * misc, STRBUF * str);


//----------------------------------------------------------
//----------------------------------------------------------



#endif	__MISC_H__

