//==============================================================================
/**
 * @file	res_snd_def.h
 * @brief	コンテスト：コンテストの複数部門で使用される可能性のあるSE定義　SE定義ファイル
 * @author	matsuda
 * @date	2006.03.17(金)
 */
//==============================================================================
#ifndef __CON_SND_DEF_H__
#define __CON_SND_DEF_H__

#include "system/snd_tool.h"


///カメラのフラッシュ
#define CSE_CAMERA_FLASH			(SEQ_SE_DP_CON_014)


//==============================================================================
//	
//==============================================================================
///鳴き声のボリューム
#define CONTEST_PMVOICE_VOLUME		(127)



#endif	//__CON_SND_DEF_H__

