//==============================================================================
/**
 * @file	res_id.h
 * @brief	ビジュアル部門で使用するアクターのキャラID等の定義
 * @author	matsuda
 * @date	2006.04.12(水)
 */
//==============================================================================
#ifndef __CONRES_ID_H__
#define __CONRES_ID_H__



//==============================================================================
//	キャラID
//==============================================================================
enum{
	R_CHARID_START = 33000,
	
	R_CHARID_FLOWER,			///<舞台下の回転する花柄模様
	R_CHARID_POKEICON_0,		///<ポケモンアイコン
	R_CHARID_POKEICON_1,		///<ポケモンアイコン
	R_CHARID_POKEICON_2,		///<ポケモンアイコン
	R_CHARID_POKEICON_3,		///<ポケモンアイコン

	R_CHARID_RANKING,			///<順位アイコン
	R_CHARID_CONFETTI,			///<紙ふぶき
	R_CHARID_METER,				///<メーター
	
	//-- サブ画面 --//
};

//==============================================================================
//	パレットID
//==============================================================================
enum{
	R_PLTTID_START = 33000,

	R_PLTTID_OBJ_COMMON,	///<常駐OBJパレット
	
	R_PLTTID_FLOWER,			///<舞台下の回転する花柄模様
	R_PLTTID_POKEICON,			///<ポケモンアイコン
	R_PLTTID_METER,				///<メーター
	
	//-- サブ画面 --//
	R_PLTTID_OBJ_COMMON_SUB,	///<サブ画面の常駐OBJパレット
};

//--------------------------------------------------------------
//	常駐OBJパレットオフセット
//--------------------------------------------------------------
enum{
	R_PALOFS_RANKING = 3,			///<順位アイコン
	R_PALOFS_CONFETTI = 2,			///<紙ふぶき
	
	R_CONRES_COMMON_PAL_NUM = 4,	///<常駐OBJパレットの本数
};

//--------------------------------------------------------------
//	サブ画面の常駐OBJパレットオフセット
//--------------------------------------------------------------
enum{
	R_PALOFS_SUB_AUDIENCE_HEART = 0,	///<観客が出すハート
	
	R_CONRES_SUB_COMMON_PAL_NUM = 2,	///<サブ画面の常駐OBJパレットの本数
};

//==============================================================================
//	セルID
//==============================================================================
enum{
	R_CELLID_START = 33000,

	R_CELLID_FLOWER,			///<舞台下の回転する花柄模様
	R_CELLID_POKEICON,			///<ポケモンアイコン
	R_CELLID_RANKING,			///<順位アイコン
	R_CELLID_CONFETTI,			///<紙ふぶき
	R_CELLID_METER,				///<メーター

	//-- サブ画面 --//
	R_CELLID_AUDIENCE_HEART,	///<観客が出すハート
};

//==============================================================================
//	セルアニメID
//==============================================================================
enum{
	R_CELLANMID_START = 33000,

	R_CELLANMID_FLOWER,			///<舞台下の回転する花柄模様
	R_CELLANMID_POKEICON,			///<ポケモンアイコン
	R_CELLANMID_RANKING,			///<順位アイコン
	R_CELLANMID_CONFETTI,			///<紙ふぶき
	R_CELLANMID_METER,				///<メーター

	//-- サブ画面 --//
	R_CELLANMID_AUDIENCE_HEART,	///<観客が出すハート
};

//==============================================================================
//	マルチセルID
//==============================================================================
enum{
	R_MCELLID_START = 33000,
};

//==============================================================================
//	マルチセルアニメID
//==============================================================================
enum{
	R_MCELLANMID_START = 33000,
};



#endif	//__CONRES_ID_H__

