//==============================================================================
/**
 * @file	visual_snd_def.h
 * @brief	コンテスト：ビジュアル部門　SE定義ファイル
 * @author	matsuda
 * @date	2006.03.01(水)
 */
//==============================================================================
#ifndef __VISUAL_SND_DEF_H__
#define __VISUAL_SND_DEF_H__

#include "system/snd_tool.h"


//------------------------------------------------------------------------------
//	PLAYER3
//------------------------------------------------------------------------------
///観客盛り上がり時のSE
#define VSE_AUDIENCE			(SEQ_SE_DP_CON_007)

//------------------------------------------------------------------------------
//	PLAYER1
//------------------------------------------------------------------------------
///ハートが生成された時に鳴るSE
#define VSE_AUDIENCE_HEART		(SEQ_SE_DP_CON_003)	//(SEQ_SE_DP_CON_004)

//--------------------------------------------------------------
//	
//--------------------------------------------------------------
///ドアが開く音
#define VSE_DOOR_OPEN			(SEQ_SE_DP_DOOR_OPEN)
///ライトがつく音
#define VSE_LIGHT				(SEQ_SE_DP_CON_019)
///カーテンが勢いよく上がる時
#define VSE_CURTAIN_LVUP		(SEQ_SE_DP_CON_020)


#endif	//__VISUAL_SND_DEF_H__
