//==============================================================================
/**
 * @file		msg_msg_tv_03.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_MSG_TV_03_H__
#define __MSG_MSG_TV_03_H__

#define	msg_tv_03_01_01		(0)
#define	msg_tv_03_01_02		(1)
#define	msg_tv_03_03_01		(2)
#define	msg_tv_03_04_01		(3)
#define	msg_tv_03_05_01		(4)
#define	msg_tv_03_06_01		(5)
#define	msg_tv_03_07_01		(6)
#define	msg_tv_03_08_01		(7)
#define	msg_tv_03_09_01		(8)

#endif
