//==============================================================================
/**
 * @file		msg_c01r0501.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C01R0501_H__
#define __MSG_C01R0501_H__

#define	msg_c01r0501_oldwoman1_01		(0)
#define	msg_c01r0501_pikachu_01		(1)
#define	msg_c01r0501_eneco_01		(2)
#define	msg_c01r0501_woman2_01		(3)
#define	msg_c01r0501_woman2_02		(4)

#endif
