//==============================================================================
/**
 * @file		msg_d05r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D05R0101_H__
#define __MSG_D05R0101_H__

#define	msg_d05r0101_gingaboss_01		(0)
#define	msg_d05r0101_gingaboss_02		(1)
#define	msg_d05r0101_gingaboss_03		(2)
#define	msg_d05r0101_mount_01		(3)
#define	msg_d05r0101_mount_02		(4)

#endif
