//==============================================================================
/**
 * @file		msg_c03r0201.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C03R0201_H__
#define __MSG_C03R0201_H__

#define	msg_c03r0201_girl3_01		(0)
#define	msg_c03r0201_girl3_02		(1)
#define	msg_c03r0201_girl3_03		(2)
#define	msg_c03r0201_girl3_04		(3)
#define	msg_c03r0201_girl3_05		(4)
#define	msg_c03r0201_oldwoman1_01		(5)

#endif
