//==============================================================================
/**
 * @file		msg_t06r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_T06R0101_H__
#define __MSG_T06R0101_H__

#define	msg_t06r0101_oldman1_01		(0)
#define	msg_t06r0101_oldman1_02		(1)
#define	msg_t06r0101_oldman1_03		(2)
#define	msg_t06r0101_seven2_01		(3)
#define	msg_t06r0101_seven2_02		(4)

#endif
