//==============================================================================
/**
 * @file		msg_w226r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_W226R0101_H__
#define __MSG_W226R0101_H__

#define	msg_w226r0101_01_01		(0)
#define	msg_w226r0101_01_02		(1)
#define	msg_w226r0101_01_03		(2)
#define	msg_w226r0101_01_04		(3)
#define	msg_w226r0101_01_05		(4)
#define	msg_w226r0101_01_06		(5)
#define	msg_w226r0101_01_07		(6)
#define	msg_w226r0101_02_01		(7)

#endif
