//==============================================================================
/**
 * @file		msg_r221r0201.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_R221R0201_H__
#define __MSG_R221R0201_H__

#define	msg_r221r0201_oldman1_01		(0)
#define	msg_r221r0201_oldman1_02		(1)
#define	msg_r221r0201_oldman1_03		(2)
#define	msg_r221r0201_oldman1_04		(3)
#define	msg_r221r0201_oldman1_05		(4)
#define	msg_r221r0201_poster_01		(5)

#endif
