//==============================================================================
/**
 * @file		msg_c03r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C03R0101_H__
#define __MSG_C03R0101_H__

#define	msg_c03r0101_man1_01		(0)
#define	msg_c03r0101_boy2_01		(1)
#define	msg_c03r0101_boy1_01		(2)
#define	msg_c03r0101_babyboy1_01		(3)
#define	msg_c03r0101_middlewoman1_01		(4)

#endif
