//==============================================================================
/**
 * @file		msg_c03r0602.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C03R0602_H__
#define __MSG_C03R0602_H__

#define	msg_c03r0602_gentleman_01		(0)
#define	msg_c03r0602_boy2_01		(1)
#define	msg_c03r0602_boy2_02		(2)
#define	msg_c03r0602_oldman1_01		(3)
#define	msg_c03r0602_assistantm_01		(4)

#endif
