//==============================================================================
/**
 * @file		msg_t05r0501.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_T05R0501_H__
#define __MSG_T05R0501_H__

#define	msg_t05r0501_wall_01		(0)
#define	msg_t05r0501_oldwoman1_01		(1)
#define	msg_t05r0501_oldwoman1_02		(2)
#define	msg_t05r0501_oldwoman1_03		(3)
#define	msg_t05r0501_wall_02		(4)

#endif
