//==============================================================================
/**
 * @file		msg_c06r0301.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C06R0301_H__
#define __MSG_C06R0301_H__

#define	msg_c06r0301_oldman2_01		(0)
#define	msg_c06r0301_boy3_01		(1)
#define	msg_c06r0301_boy3_02		(2)
#define	msg_c06r0301_boy3_03		(3)
#define	msg_c06r0301_boy3_04		(4)
#define	msg_c06r0301_boy3_05		(5)
#define	msg_c06r0301_boy3_06		(6)

#endif
