//==============================================================================
/**
 * @file		msg_d29r0102.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D29R0102_H__
#define __MSG_D29R0102_H__

#define	msg_d29r0102_rival_01		(0)
#define	msg_d29r0102_gkanbu2_01		(1)
#define	msg_d29r0102_gkanbu2_02		(2)
#define	msg_d29r0102_rival_02		(3)
#define	msg_d29r0102_rival_03		(4)
#define	msg_d29r0102_rival_04		(5)

#endif
