//==============================================================================
/**
 * @file		msg_r206r0101.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_R206R0101_H__
#define __MSG_R206R0101_H__

#define	msg_r206r0101_shopm1_01		(0)
#define	msg_r206r0101_shopm1_03		(1)
#define	msg_r206r0101_shopm1_02		(2)
#define	msg_r206r0101_girl2_01		(3)
#define	msg_r206r0101_girl2_02		(4)

#endif
