//==============================================================================
/**
 * @file		msg_c08r0501.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_C08R0501_H__
#define __MSG_C08R0501_H__

#define	msg_c08r0501_oldman2_01		(0)
#define	msg_c08r0501_boy3_01		(1)
#define	msg_c08r0501_boy3_02		(2)
#define	msg_c08r0501_boy3_03		(3)
#define	msg_c08r0501_boy3_04		(4)
#define	msg_c08r0501_boy3_05		(5)
#define	msg_c08r0501_boy3_06		(6)

#endif
