//==============================================================================
/**
 * @file		msg_d16r0103.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D16R0103_H__
#define __MSG_D16R0103_H__

#define	msg_d16r0103_seven2_01		(0)
#define	msg_d16r0103_seven2_02		(1)
#define	msg_d16r0103_seven2_03		(2)
#define	msg_d16r0103_sppoke11_01		(3)
#define	msg_d16r0103_sppoke11_02		(4)
#define	msg_d16r0103_seven_01		(5)

#endif
