//==============================================================================
/**
 * @file		msg_d28r0103.h
 * @brief		メッセージID参照用ヘッダファイル
 *
 * このファイルはコンバータにより自動生成されています
 */
//==============================================================================
#ifndef __MSG_D28R0103_H__
#define __MSG_D28R0103_H__

#define	msg_d28r0103_gkanbu3_01		(0)
#define	msg_d28r0103_gkanbu3_02		(1)
#define	msg_d28r0103_gkanbu3_03		(2)
#define	msg_d28r0103_sppoke3_01		(3)
#define	msg_d28r0103_sppoke3_02		(4)

#endif
