//============================================================================================
/**
 * @file	gamedata.h
 *
 * 2006.05.30
 *	ゲーム進行データなど（エメラルドより）を記述していたが検索で誤解を招きやすいなど
 *	意味がなくなったと思われるので大幅に内容を削除した。
 *	もっとも重要なPERSON_NAME_SIZEなど文字列長の定義はbuflen.hに移動した。
 *
 */
//============================================================================================

#ifndef __GAMEDATA_H__
#define __GAMEDATA_H__

//	名前などの長さ定義
#include "system/buflen.h"

//-- ポケモン手持ち最大数 --//
#define TEMOTI_POKEMAX		6

#endif // __GAMEDATA_H__

