//============================================================================================
/**
 * @file	msg_ds_icon.c
 * @brief	画面注目アイコン処理
 * @author	Hiroyuki Nakamura
 * @date	2006.02.22
 */
//============================================================================================
#ifndef MSG_DS_ICON_H
#define MSG_DS_ICON_H
#undef GLOBAL
#ifdef MSG_DS_ICON_H_GLOBAL
#define GLOBAL	/*	*/
#else
#define GLOBAL	extern
#endif


//============================================================================================
//	定数定義
//============================================================================================
// 外部コントロール
enum {
	MSG_DSI_REQ_START = 0,	// 一時停止状態から再開
	MSG_DSI_REQ_STOP,		// 一時停止
	MSG_DSI_REQ_FREE,		// タスク解放
};

// 転送画面
enum {
	MSG_DSI_MAINDISP = 0,	// メイン画面
	MSG_DSI_SUBDISP,		// サブ画面
};


//============================================================================================
//	プロトタイプ宣言
//============================================================================================

//--------------------------------------------------------------------------------------------
/**
 * アイコン点滅タスクセット
 *
 * @param	pfd		パレットフェードデータ( NULLの場合、VRAMに直接書き込む )
 * @param	disp	転送画面
 * @param	pal		パレット番号
 * @param	heap	ヒープID
 *
 * @return	タスクワーク
 */
//--------------------------------------------------------------------------------------------
GLOBAL void * MSG_DsIconFlashAdd( PALETTE_FADE_PTR pfd, u16 disp, u16 pal, u32 heap );

//--------------------------------------------------------------------------------------------
/**
 * タスクのシーケンスを外部コントロール
 *
 * @param	work	タスクワーク
 * @param	req		リクエスト
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void MSG_DsIconFlashReq( void * work, u8 req );

//--------------------------------------------------------------------------------------------
/**
 * タスクを外部から削除
 *
 * @param	work	タスクワーク
 *
 * @return	none
 */
//--------------------------------------------------------------------------------------------
GLOBAL void MSG_DsIconFlashDelete( void * work );


#undef GLOBAL
#endif	/* MSG_DS_ICON_H */
