//============================================================================================
/**
 * @brief	playtime_ctrl.h
 * @brief	プレイ時間の更新
 * @date	2006.06.21
 * @author	taya
 */
//============================================================================================
#ifndef __PLAYTIME_CTRL_H__
#define __PLAYTIME_CTRL_H__

#include "savedata\playtime.h"

//------------------------------------------------------------------
/**
 * 初期化（ゲームメインループの前に１回だけ呼ぶ）
 */
//------------------------------------------------------------------
extern void PlayTimeCtrl_Init( void );

//------------------------------------------------------------------
/**
 * プレイ時間のカウント開始（ゲーム開始直後に１回だけ呼ぶ）
 *
 * @param   time		プレイ時間セーブデータポインタ
 */
//------------------------------------------------------------------
extern void PlayTimeCtrl_Start( PLAYTIME* pt );

//------------------------------------------------------------------
/**
 * プレイ時間のカウント（メインループ内で毎回呼ぶ）
 */
//------------------------------------------------------------------
extern void PlayTimeCtrl_Countup( void );


#endif
